{"_id":"fe0183cc-1a55-33f5-ae78-d0555b1d62e0","authorName":"xenonforlife","authorEmailEncrypted":"iUVtYMwW5uykd5M3teCvzu+VLKLuIBp36sCVcRNtNs2EsB2O9Fz7HOQlSGNiwBrYWttRz3v2Hc9W8l491YkzlvBA3OrXb9xg3eRSzFVOiCc9a6z7wRbnnex/ODWJL3zn0ftb5LcucbqPTmcqgzc2Hh/9PeVZdWEruDGSjjOTHgLsjR9qPXxm1qNSbzRZTm3aLHaFT8FrW2W39cmWyEWaiCVOXuDfGA74hsBUdn9nlJR1Bcs02No/zNKlM+65QWyRZFb0Z6cyXVTzsmarNCjTRrXY2XmnhOQClk94jlgtV3FqCqbRZ5Ei/07dq4lLjro0l3hgo2n2jFAyKwO3HMvv2IAM3D4egli55k3ztWVlPdRRcmuiP18BnkyYovdaw354cFCgmx33w8VN4dM3fq2xlf1YmXIxHlgxzmAUR7eBIHCgIzsXCZvQl83K7UCDIJ/wBUopU2fFiTSwhkYFxp2F26hSpteQBO0zBXmD8Ln3a6YqL+yM60/9CmfgxuuCbHBeXRmFDULKswSm99ZIewZEAUeSdRkf/gQ+Kr58cLFpLglxzRB3woOSAuBKiprgTZ6wad6K91k480HUEXqLxpdgALPWXYQ8V6HgY4meEVpSGE37kVve+XBQ73IyhxeQPbOjuILf6/HSHmkZybBikXuoDOhYmLJ7+AxIeAfQ3YKzRhg=","authorEmailMD5":"678244a0ad782aa2a25518ca6168b046","authorUri":"","authorUserId":"disqus:xenonforlife","authorFallbackAvatar":"","message":"Thank you so much for the speedy reply Stephen, I did think of this solution infact but then this approach poses another problem (which maybe disadvantageous in my case of contacting the external hardware) that as soon as any ActionBlock is about to be over it would trigger a batch, therefore I would somehow run into fragmentation of an otherwise (preferably) larger batch. The next thing I was considering is triggering it from the TransformBlock (as the first thing in the transform block, here too in order to start the pipeline I would have to start it once externally but after that it would be self-regulating). This way each successful propagation of a batch through the transform block to the buffer block (after transformation) would trigger a new batch (wouldn't it?). But in this case then for a smooth operation should I then set the BindingCapacity of my BufferBlock to 1 (or equal to the number of actionblocks)? so that when there are no actionblocks to accept an element from the bufferblock, the bufferblock inturn stops accepting inputs from the TransformBlock (and this is the point where I am getting stuck, since at this point the pipeline is self-regulating wouldn't the transform block keep buffering its output if the Bufferblock is not ready to accept it, since from the documentation I could understand that this un-accepted output would be postponed/declined, but I am not sure how that works, but this is the point where unfortunately I am getting completely stumped)","postId":"2012_11_async-producerconsumer-queue-using-7d55b643-a325-3ba0-9ffa-7ec6b0363eaf","replyTo":"0c68d212-a193-390e-a2d4-016074e0b03b","date":"2015-09-10T21:58:44Z","timestamp":1441922324}