{"_id":"7dca2dbf-6224-3846-b867-136c87aca7a7","authorName":"xenonforlife","authorEmailEncrypted":"f77QboRjV+6nZxGGBJWAx1ffdxv+ZsA9/sW31gzm7NLbKmjewZeYgd/loh/tcF55acI30vU0r6mOfJ2lT95ycNIIrJooBkyHcVRNb3ahnNAkRYpaiWXwd8XLHyH2k/PsHhTzvgaLmpJIwa9B2wXbkJEB4KB5dv3evfOwF4RMTJsLILQRoJt6GE/gnMxWJDakf2JO1pZ/tcWiN3UAzjgfAWI74NxUVjiyQJEgaHsot5ewUGMbsKibApHV3BhOksFE1v/R7fTlSdwAahjXpsIJ30nlcTGMMLhkNUumrJ3F4jYZEQi4yUzmQkznSoFvyspbJmiJ+ys80DUkmu7gtI+ebPaTvYoP2B9pdFzcHf2B0KY+tikKskcrOeq5ROHIOcr3a32r6eBUvxmUEFJhBgHehUOPASRYdlpJC2+5Z9O8DYIN138HKEPoB51WZ5mzDiAwLcUZG2uvh4p4d36rk1579YPiLcZYPRMqyqNX+N1nFUtqIxAXMAlA7luPaaETqs9AGtKyHAlw2PEXlsAo+g83Q/bQotB9ngw1/6g5W4PkvPjyOmeWP93aA0NvHBlmFpZee2Bv3l3iBpqeEn04oDNiH3fJDxiYo/fnaaJumoKA7SwguPLG5c19TJmHlXJ4YTkZl/CytPWmrpSDCUlqfwEBz8O3PLzvpdYDBQKrNaEcYYQ=","authorEmailMD5":"678244a0ad782aa2a25518ca6168b046","authorUri":"","authorUserId":"disqus:xenonforlife","message":"I just hope this blog post is still alive, I am just learning how to use TPL Dataflow and well am getting confused over and over again. I hope I get some insight from the expert himself. So in my Producer-Consumer scenario, the bottleneck is really on the Consumer end. I have multiple consumers as you, and each of the consumers send an action to external hardware, which may take some time. My Pipeline looks somewhat like this:\r\n\r\nBatchBlock --> TransformBlock --> BufferBlock --> (Several) ActionBlocks\r\n\r\nJust as in your example, my ActionBlocks are the consumers. I have assigned BoundedCapacity of my ActionBlocks to 1.   \r\nWhat I want in theory is, I want to trigger the Batchblock to send a group of items to the Transformblock only when one of my Actionblocks are available for operation. Till then the Batchblock should just keep buffering elements and not pass them on to the Transformblock. My batch-sizes are variable. As mandatory, I do have a really high upper-limit for BatchBlock batch size, however I really don't wish to reach upto that limit, I would like to trigger my batches depending upon the availability of the Actionblocks permforming the said task. I know I should use the TriggerBatch() functionality of the BatchBlock somehow but am really running out of ideas of how to approach the problem.","postId":"2012_11_async-producerconsumer-queue-using-7d55b643-a325-3ba0-9ffa-7ec6b0363eaf","replyTo":"","date":"2015-09-10T15:11:54Z","timestamp":1441897914}