{"_id":"02a16955-1167-30ef-a48b-7dc0c47e42b0","authorName":"Buggy Squashy","authorEmailEncrypted":"NR9aYuNkezCUsvprLzp7OQm/DP1kVD3GTXbBR4mV101L+Y92a+psb+rVzDfGJ7fUVYyIYkJ6yJGJ48DbPG/VGLO+uc619B+Goev+xTywYEwAxBxsNT8q6GUiehP3FXawEHaApQ1rHXotGvld5GtEEQj19DopZwuspRU/SW7idaQ542Xl1SdjZ017pwdTBeEr9ehcbP1PfY18gOSOO0xll+YS9qq6+iFeGSxjFyOciHwD0YpP7NxVIUdzrD2CPCMBklhEBLBhZ0041eW65t24c2svPQypJzo7St9+U7ACu2axIKoT+sqISMUxg+YqkmjDtZX/6H3EiM9HWAet+sGRgSDe5oDwIsneyPulnmZ5Z18++NUNXKWCF2jCrzvp/99ul+N0YPUbKKFIiPOhNydJV8AqoAFwOd6NSUfL+50D2bcm04impKJixGmPICYA38FveuX/1Bc1K9TWgOB7M1Fy+Yw3/zobaTIZ7z5uuq7p4BZg2XiBCtJvR7oYbYpqmayirAXKPgrNJI/Zs1NriMm10fjdT9t0swYGMBX3KJcVwQTbBBOVp+Ugj0WQ1YWBC4zBLPW+xXsnk7mb25HcafBsHJDheTmuhzVKVojd2izgNLTSK3SDjcpCIJLZmPxKgjY5Ck023ZfW31P7Mrmqaxnt5f+AptemGmQGyeJZ9mICDd8=","authorEmailMD5":"b13725d59b683df333736b9a404801df","authorUri":"","authorUserId":"disqus:buggysquashy","authorFallbackAvatar":"","message":"Hi Stephen, regarding the above, I guess a couple of more questions. Thanks so much for your patience, and apologies, I accidentally deleted my top level original post/comment, not sure how to re-insert it. Anyway here are my questions, (9) In the Consume method, right after I get the current item from ReceiveAsync() and am ready to process it, supposing there's segments of this processing code which are blocking, is it better to do move these out to some point so they are executed before I even enter the Produce/Consume cycle (e.g., in your test method before I get in the Produce method call? Is there a way to do this between the Produce and Consume calls? (10) For the CancellationTokenSource corresponding to each item, and other such flags or data structures associated with each item, if I initialize them before the call to Produce, then in the Consume method inside the while loop, if my process on each item received is invoked as an awaitable as: bool ok = await my_process(item), and if I check the boolean \"ok\", before populating the CancellationTokenSource or any other other flag or data structure corresponding to the item, then there shouldn't arise any race conditions, am I correct? I'll plan to test these also myself. Thank you.","postId":"2012_11_async-producerconsumer-queue-using-7d55b643-a325-3ba0-9ffa-7ec6b0363eaf","replyTo":"e1a40902-dfa8-3d2b-a7f0-2081bbc6a956","date":"2016-08-18T14:49:37Z","timestamp":1471531777}