{"_id":"a10a677c-82fe-3019-bb90-c0abd2c0ef42","authorName":"Buggy Squashy","authorEmailEncrypted":"UG0o5h++pW0pSMgNY+Iq8VRM4TinEUkf63JCjs/srOgpZaHswKAV2lLzBVTxfUfoNVr5VLw5qm1QlfFqG43eUaDxNkvZYS8IwhTmNwo25InGSF3Vzk9wYR2mF1wPn+inz3RVJceze+0nGnP5KcMcjcFl7sG6zMPR7DI5hJqv1zCw7uHWDsQsBiKBh+KsI6DSzNWxU1NkbKRNwWxqkXunnV7ezcRPqwTmBsjYQQo2Ts7T8uQl60wLkdnS6j7nEbKAJHnemRlhmOEz1jpkpUli2weJDZUtT7iTjqGARbKYpatPd1cu7WGLBlM25dtDw/9xsV+WLn/Wv4JfiZmGReNJ4VcWZL90RsTiLJKIHSl3Rnr7zdEIszoCllZwn1XsfzgoytwNb8seu+mmDBD6r7MS8LihQuoqgED2UPRCfCAb1kiYoiuG7W01sk6TMi7JcxfnNwfIN/S/TexzXJp9tSfw6gtKGK86rIFQpYa2adLpi1QieciCXqo7AI8C/zisX6Sc1MCGZNQeqKX3QW51kAATyfnf8hYDL5Ac75p1KT2G/trkGEqh6fkJvlT96BRP0LzA1kIzhbwLmevuVmykZNoo2clbv8ffPiDtpgrzHk5VFRG0+Ajn7SXIRxYYaoc46PHBR62ioPggyNI/gNd94N+NhUIRnjdeZthx7AkLFbCYqXE=","authorEmailMD5":"b13725d59b683df333736b9a404801df","authorUri":"","authorUserId":"disqus:buggysquashy","message":"Appreciate your response. I guess few more questions - (5) do your Produce/Consume methods have to be 'static'? In what context would this be useful? Reason I ask is that I don't want to use static data member BufferBlocks as well for this, and also I read somewhere that using static is not thread friendly. (6) In my situation user selects a number of cases and submits them to run, upon which, my framework \"produces and consumes\" the resulting queue as you showed; based on this it seems like my case fits the single producer, single consumer description, am I correct? (7) I am trying in my initializer do just like you did, but instead of a constant, I am trying to set the BoundedCapacity to a private int data member MaxDegreeOfParallelism, but I keep getting an error \"A field initializer cannot reference a non-static field, method, etc\", any idea why I can't do this? Does this mean my private data member MaxDegreeOfParallelism has to be static to initialize like this? I confirmed that works, but could this have other implications as a result, as in (5) above? (8) You mentioned that each item is immediately removed before its processing begins. Does this mean that the item is removed from the queue in the Consume method as soon as queue.ReceiveAsync() receives the item, in your example above? Also, if I understand correctly, the processing on an item (or in my case running the case), if any, has to be done right there as soon as the item is received, right? Thanks.","postId":"2012_11_async-producerconsumer-queue-using-7d55b643-a325-3ba0-9ffa-7ec6b0363eaf","replyTo":"a91c41db-eb22-37bd-8dfb-9de70b96158d","date":"2016-08-16T19:45:14Z","timestamp":1471376714}