{"_id":"3e7b1e3d-30e3-373e-96b4-f985c6c277dd","authorName":"Eric Hesse","authorEmailEncrypted":"HnuGoi5b9mlwrmUv+K5kgkGHilpAsC2vQZHXwSR+phgVnM3mx+CJLbF6fDjLkiTFJ/tEqVoQpBtLjJfWXzrkQX7fISmOZ7OfdwJSmXZ1tGwXaAmJZr3S1FO/+rQFkXNsgDbzcbsHI5FdH8ekc85ujyHLTNPIFjS9/YOgfWZd4MBazf7HzKNfZrWe6V2dFlQC/Dkq527eaL3YHK2fYdNDvIjskspZ32qZr8+KAgYEsBGLt1SvJQ645s9LooXOeY6xv89ZfkJhEsCO09/BvAMG17vHR8SvPcC2prKxSrzinehUCB8jNhjlw5Mj2KlvB/uLPj7gsjo8HlgJx9Tdm0ICL0hmBp5Wwa3XI1g2bKBR4gmmERYT6+gFrS5ilkwlAm78yrwqDfFg/6Srp2r4Hhyn6y8WdfvMKpstSESr0RfTGujlCKd0FjrNtZCAy9nC/NhaZb+Kd5Q6bc7sBlU7nG/bRRm/uVWZAUn+zMCUql4Git0ujQgRt/KDPoWjtunyV8HJIVEtxUVgAFFdUIpMg2lGJAqx+vjTvYAY/ZVmJB7YVPJ6ginwIiW5csnZTdKByIEFB/vn6ryZ3Fcub93vnphJv3j+b1aVcHCFeIxhjIOfp1awBzmOY/VJI5kHu9jx2w2HW7RyCaFQY+u8qrEQinnyj3PPgnKnf0g3IlO8zFesx5k=","authorEmailMD5":"031134010a19b24e448a57f4ca9d5f46","authorUri":"","authorUserId":"disqus:eric_hesse","message":"Hey Stephen - a great article ... thanks. Quick question. I am a middleware guy, using IBM DataPower. Our client has a cloud application that submits SOAP requests to DataPower where we then send it off to a backend application. I am not allowed to ask for any changes to the client application, so we cannot add keep-alives or any other solution requiring a change on their end. When the client application goes away without sending us a RST packet, DataPower never knows the client has gone away until it tries to send the response back. DataPower, after failing to get an ACK packet, retries to send the response 8 times before giving up. At that point, DataPower does not pass that failure up to the application (XSL) layer so we cannot process that error (by, for example, un-doing the financial transaction at the backend). I'm told that capturing this specific failure is easy in Java and other tools, but I wrote Java HTTP and Socket servers which do not throw an exception for this case. Without altering the client for solutions you noted in this article (i.e., keep alives), can you tell if it is possible for this exception to be caught at the application layer (as opposed to the underlying OS IP layer which might not pop that error up)... and if so, what is the best way for me to show that via a proof of concept?","postId":"2009_05_detection-of-half-open-dropped-f127b1d1-2c83-3dd0-9e4b-214360c6e878","replyTo":"","date":"2017-05-06T00:35:20Z","timestamp":1494030920}