{"_id":"0a5def96-9136-341d-807b-496d18c7f85e","authorName":"SharpTag","authorEmailEncrypted":"k8Xik9Xpgfq62W2ZdjGMTvp4cMEIfhfzC5yOau8sNtVP4nhBi98ju9HTs5kQ2v7nEapYttrAhUFry8nSRjsIBTFuo4XOcysRbcmJWY1olmjsNww9zeBUY4EDP4Lm5GlJCgkQvKWNQPF536KaXfpVMsIwANb+rwKjaviBa7kQlbD5Sye5XbwMrfA8Il1eVZhLjYficN2NrANyRjrmFB2iXCWF46nI+pNyxnynEBKlGg0CAhdqJgX37QavzFhzGjzpgo6Ce0ZZgQQeNl0YCGFc/UbT3Bx5XnJp6vsL/WkBd+s3ctQIo8DXByqk5XKS8X9EISGiZzBW0vpMdhLKGLi0gHqwpzqgWKxM2lXW9qr3UyLBxkcn4wcql+7gSAG4Lr0Ncp1FQjs67T6qce9vO+Rp0Cc7z7YqeZp/Fk3wHUr29jvC8DdY9+KFzH536oKlmlfKf2lIJSMmOL9kWP7ESPuQyCKquF8mpnZcKh/g3Fcz2Cx/vHaBpJBFN3fYwcjrA/G3TC9LfKxMrXgAuKvZUs5lyON2Jq8uaNAH89EQavcBWqkCbfuNETWatA73GJBOnNmWdgRzRO6Yu+swhKwAjb4IcEwawMZsedIeT59GTcHMBlLwFOX/ctcoRL0lskZBaogQbQ05q+jBF3tKl/tsxpi2fvBBAcajtj/VWPXb7FEYdb0=","authorEmailMD5":"5164af4f96639d26aa14d0570108de15","message":"In case anyone wanders by and starts to build a mental model of this, just think of the DPC as part of the Windows Kernel. It is just getting the next available time slice which means it runs in whatever thread or process the scheduler has running but it has no interaction with the thread other than the ability to clobber RAM anywhere on the computer. Although it can only be interrupted by NMI, the fun part of the mental model is that there is a DPC Queue for every Core on the CPU. So the next slice could be on any Core. If the device has another ISR which most often is the case you now have more than one DPC servicing your Async request. Now everything is at the mercy of the Device Driver programmer to SpinLock the right memory locations and coordinate all the literally non-time sliced but actually simultaneous DPC's so that I/O completes without incident and starts the more orderly sequence nicely described in the article to return to Windows Userland. There really isn't any analogy or sense to be made out of the DPC system from the perspective of a C# programmer, but it is awesome to visualize your code running simultaneously and that SpinLocks are executing constantly on everyone's computer to make this system work. If you have 8 cores, they all stop completely dead doing absolutely nothing during the few microseconds of the lock. Not elegant at all!","postId":"2013_11_there-is-no-thread-a4d25d49-dbfd-39fd-9b16-ff58dd4a1ff2","replyTo":"a8dd8eac-88e2-3dde-b645-4a475a8dfb1f","date":"2016-09-06T02:07:16Z","timestamp":1473127636,"authorUserId":"disqus:sharptag"}