{"_id":"7003d7ac-f514-3215-b38e-245d3191a169","authorName":"Stephen Cleary","authorEmailEncrypted":"Ikv8APgweHWAQmD5l7LtDYfy3FTHaU6zJSxA+Fj0qcqs6VKmQjjADR9Rp0NaQi0814dWEenPx9IAUXNu4TAOKyiLhX9Koo927byl/+FrrrWtPIt39VNIICNKUJ1ppDMWwpZpachEe7NPXrA/xtjIhdh9qNLlGd944eq5hd9CaK47ZDZQKQ2CRrE277+6pcLnZn9d4BxoOf2eYQceV4lhH0b3PnxpUIu6BLxenTTUBa6f5Exr7lk+SKGCEFTrxLEoxg+Ao63EcVj/5OZ1OKVatyR38Rr5LhUn4ohRpMoi8qvFGAEP2kz72DJdqW5G6UDDrS+wK+Jv8xhRKuAcA99L0oLvSHd1pk0BuqPJOkLgKdKr8jXfDYMtNDeUii5Lf+IU9RgxXL3AlND/RuvXuBxxQXWGkZIQqDnusd9wG3lRYtBMfVxvAdW6N1TMaos7hIdunaTRU6v/QB/m9p1qcAJRPUqylLrMrV7MfCkJsxn9P+JXQxi7PRGvMCYxnsc3oEfUIgB5RsCA8FCh4txXVcpohf4AYPgQZYm+XgBQfDu4X3foF1K1IJNWfQWFK4jMCY+nwALNTFcseGDH/cqT1sxn9AM/Q5vZUzVFbZhqDvXz2IA1WaeQ2bgKW4pcgSK4rCgh0DQq7Gk2Uu4qBPtzYeSn24jLFSNNz8Mga2vWm5L+814=","authorEmailMD5":"ad2250182ff26a84dda974e50cd94382","message":"Oh, yes, this article is quite incomplete. Among other things, I completely skipped over how caches influence this flow.\r\n\r\nBut I think we can agree that the idea [that there is a thread blocked \"doing\" the I/O] is incorrect. In my experience, this is an *incredibly* common assumption. When I talk about async to .NET developers at conferences (so these are not even the dark matter developers), it's always >50%; I'd estimate around 80% (or more) just believe that programmed I/O is still how it's done. :)\r\n\r\nI was not even aware of IoIsOperationSynchronous! I knew that Linux drivers know the asynchrony of their ops, but I wasn't aware that was true on Windows, too. I'm having a hard time thinking of a real-world use case, though; any driver would *have* to support async (the hard part), and it *can* support async-only (and most do AFAIK), so why have a second path? Seems like it would severely complicate the code for no real benefit.\r\n\r\nI also didn't remember the details around APCs and threads. Since .NET-based I/O generally uses a single process-wide IOCP, that's the only case I covered in this article. In particular, I did not remember that it had to return to the *same* thread outside of an IOCP; I had actually assumed that *any* thread in the process (sharing the same address space) would work.\r\n\r\nAnd finally, yes, as you (and others below) have pointed out, the IOCP itself does have (a) dedicated thread(s). But this would be true even if the end-user code never called any I/O methods. In other words, asynchronous I/O doesn't take up *additional* threads that are dedicated to a specific operation.","postId":"2013_11_there-is-no-thread-a4d25d49-dbfd-39fd-9b16-ff58dd4a1ff2","replyTo":"9572473e-4ff7-3551-92be-614b308d6ca3","date":"2016-06-13T18:42:13Z","timestamp":1465843333,"authorUserId":"disqus:stephen_cleary"}