{"_id":"b89eb870-38c3-39d1-9110-33dd38da8efc","authorName":"Andy JW","authorEmailEncrypted":"N4ZyxZDaGBC90wOXxLesj0zMz2nOjKDD9wIQAnzZqKKi3ZBJUGc15XH/CxW3V8DHahTCTVlz5bMCH5691a2/uhiYUKrOJoFiAcSEgRH8TfwVwP1+JWMb2EB/ExoRrBYSoPhfPsQjZ///hGFJcE/5zTkQuLvdb526hyUt4Mf9yr4XtTLuJvKIq8NyLXtDjFu+b/6Q6HbAZAF1UBfVFYBB8ohSKz+Ak4f+a1AG67M6BaknMvCylEtmXWvx0wyT5n0x6p5G0vH+/kuHmPEIM6+h7j6EJSfe2gfl30+fYlpcgwiInyA5kTDrj5NskKFQjUkF0Mi1OVjslOQPE9mHMYxV1G90q4wGG8tn5mUXgkqN7K+Tlxo5qwdkQf6sR2muctbepnKSgKswA1iyeewJJSVyk8YCv5s4Cbbn3oyxYW1jrSeMQpgLi0pND0PgFT6wncUoVoJMhypmWKFuwmgJmRddCOB/zlTAW+Nl15YzzZ3CFKwf2m//19zgwa5HqmKc+1t1Q9aEgQesQIg1Kixbx6du7XWF7cnrKC45y3sBl1ShEpM6bd3H0qB8mUvkBdUS6gdTpT7t9PNltd/sQ1HQEizKHyRHAeNGRbUy3eoX9VcYKDtiCXT98ZjIXXGaSKVLvMMsXrgWoU37W3Su8npP7AReVmXRzOZu6tqCxgLgTTvi10E=","authorEmailMD5":"7a2c32431708704ac32f2e2637ef6b48","message":"Great article. IOCP's are a kernel-supported concept in win32. I am (or was) among this 80% naive you speak of because my conceptual education in EE/CS was the traditional model wherein the thread (or at least a fork/clone somewhere down the line) is blocked and put into the non-runnable state by the scheduler until the ISR is ready to toggle this. And we're taught that it's perfectly acceptable to use a small stack size for these blocking threads, with the only price at the end of the day being the context switches. I would make an argument there is nothing really wrong with this, since even with APCs you need to have one of those I/O pool threads get around to you anyway. Now, supposedly, the only equivalent to IOCP in linux is the epoll. The critical difference is that you implement this yourself at the application level. So it sounds like the exact model taken in win32 is the same pattern as what I would do if writing my own app-layer in posix. I might spin up my own pool and loop over epoll, and I might use the results to feed into a compute work queue, essentially achieving something very similar to .net async TAP.\r\n\r\nNow given that posix epoll is a user-level concept and IOPCs are a kernel-level concept, I do wonder what the port of .NET to linux is going to do. Will they basically implement the I/O completion pool as their own layer on which they will build their .Net I/O primitives? hmmm","postId":"2013_11_there-is-no-thread-a4d25d49-dbfd-39fd-9b16-ff58dd4a1ff2","replyTo":"","date":"2016-07-06T22:14:30Z","timestamp":1467843270,"authorUserId":"disqus:andy_jw"}