{"_id":"2f309c8f-c1b5-364a-862c-980332c3d6a7","authorName":"Stephen Cleary","authorEmailEncrypted":"uwk1oG9xIduA5n8ULxV2RCZTcr7GP409SIg8dtubg2I1e4OV73QEn7SKIs5VIBcFYFz2SoSYOeno93Y9xEGWMhCIAZ++H7IjpjaYV/o8tSHhtrkZDUujQ1MyTMljotpZIwxhO2Mnicbwb7asQgFtFN3/R8Dj9qiQUQ1ygksJ5K9M21qCRHFE7vmttZ6tM+WKIAGWi7qAV9GacLBggYe5caKJqX3LmE6abl8Vp8TLfMC2MTVZ5SienyUGQ71u+w1EJuyOcez93wPmVCIxLGSEqleOTfuPsOBXB8RaehopLEPwOzs5NyvsCqAEN3LDeMUR5jRcDCKd45klnxGuJCGj/0/KwdziEZE69bg7w0E93IiJn4x6PzDiO56K+wtlPNG0HFyi1rXsv1qnVYivwBl6DE4iBffNtBH54jf/Kaz/bk3FgMCMJJoiCLLzOnIMDUQBz46jjRpGHZq2qqe1RDEftdH/4wY7YOLKrE57S8XVPJ90iMMd7BQAw3Io3RFWQlp9PWLcvCogbAILjLW0V+h2m0hPuLK8h6JxqPutNqRnINA4Q6dlEq5oqrwpoli3fUXnDCk51hiOdriRv9m6m4+jbpSD17qO2yhSs7OZKhDdaH5NhdZLAUf+/Luj2RnVA/C/FxAqclTBrNfuxfpvlCPAnOgp4yf3b7l1vcgqqzCNDlY=","authorEmailMD5":"ad2250182ff26a84dda974e50cd94382","message":"I think the disconnect is here: \"I create an async task to do some background work.\"\r\n\r\nTasks that do background work (e.g., Task.Run) are not asynchronous. The UI can consume them asynchronously (just like truly asynchronous tasks), but they represent synchronous work to be done on a thread pool thread.\r\n\r\nRegarding thread switching, there's nothing special going on. Threads and CPU scheduling are handled at the OS level by the preemptive scheduler just like always.\r\n\r\nThe key behind truly asynchronous methods is that there is no \"work\" to do. Thus, no need for a thread. If you, e.g., asynchronously read from a socket, then there is no thread that has to periodically say \"is there data yet?\" Instead, the task acts like an event callback; the networking layer will tell *your* app when there's data.\r\n\r\nSo there's actually no switch away from the UI thread at all; the UI starts reading from the socket and then awaits (returning to its event loop). When the data is read, the networking layer calls back into your app, (eventually) posting a message to your UI thread, which then resumes executing that async method as a result of that message.\r\n\r\n(the details are a bit more complex - there are some threadpool threads used for extremely brief periods during the \"notification\" phase - but this is the general gist)","postId":"2013_11_there-is-no-thread-a4d25d49-dbfd-39fd-9b16-ff58dd4a1ff2","replyTo":"38b7b886-2a53-3900-bd7b-6a2588f633b6","date":"2018-02-08T18:47:40Z","timestamp":1518115660,"authorUserId":"disqus:stephen_cleary"}