{"_id":"7cd1c7ee-237f-3364-8434-1bc64a2f0b8c","authorName":"Stephen Cleary","authorEmailEncrypted":"tMzr9phuX5Bc5BTm5znA0XWTY1nB9D98UlKkX3CuUzNRjYPxBV01VMIvNhMBdUsM8iFnTpF06hy7qN2Pqk6V5Q5xecuDDyKVvkER1y6BePoy7NDwaKV2SiKWQEwcAjwQU1Mv0pKaNcVh/cDI7sqHKeR6nPJ7eelf0GnQAQ1OaPmoMGWPpiTLqeOoL9H4GhKmljrqhSfK2dVpl5/6DDNaPBYmKtR0TxUuNGosiDelgadWznl6euKCh90b0H+LCUYNJLrFbMBB0yY+z1jvhbjG7+ymJf7dUhVXwFwfbW7dYiK20cSbol8L6tbgkaxVUMYun7NQmL+0M0MajXzX7cm0ikLbOposQzKEhpTV+mlJJG+Z4gahwFKzI9YBqlBVhi8qPz48YMPvtd2oFOrFI+sce0qQd+jYVxRHrQYLpYKs6WEUkRjVNNutJ5A852gnAaw9OIXOipuLiU6TbJVWoXwrk2Lb9pGJkpEVeLTzuBDvWy+i1DP48rjlVRWJE3JIwzc0tzDrQd18UyyKGkfdI9IxSObxuJJFfUXNJYMQY6OHAoYNpEU3fAZ8/0oVHdGqQOytDYjZDfXm7FJz+nXjYnUfpMWsUhsOPiuIyUZqILZz1LVsHrJLmwd4cH1Eo/bJjB6Ub/klckWXSJ4rFnXNXK9d3j6uW3cGRxJMiqy46frW0mo=","authorEmailMD5":"ad2250182ff26a84dda974e50cd94382","message":"Yes, both views of Task are completely valid and useful.\r\n\r\nOn the one hand, Task certainly is a modern OVERLAPPED abstraction. It represents some work, often I/O-bound, which can be done by something off-CPU, and the Task will be notified when that work completes. That's a completely valid interpretation of Task, and one that is directly applicable when looking at tasks sourced from TaskFactory.FromAsync.\r\n\r\nHowever, there's another interpretation of Task that is equally valid, particularly for tasks returned from methods. When you have an async method, the async state machine creates your Task and controls it for you. As long as the method awaits an (incomplete) awaitable, the task is not completed. When the method finishes, the task is completed. If the method returns a value, then that becomes the tasks's result. If the method throws an exception, then the task is faulted with that exception. In this way, a Task represents the execution of the method.\r\n\r\nBoth interpretations of Task are correct, and both valuable in different contexts. It is the latter version, however, that most end-users are more familiar with. The vast majority of async users have that view, and really have no idea how tasks \"really work\" at the lowest level - they only compose existing tasks into higher-level operations using async/await. All their experience with creating tasks is done via the async state machine. And the expectation from that mindset is that if an API method returns a task, then that task represents the execution of that method (and thus, they expect exceptions to be placed on the task).","postId":"2016_12_eliding-async-await-98a72933-845d-3c59-9bd5-b4160554a9f7","replyTo":"78a86ac4-941f-35f6-b361-f4620166e04e","date":"2016-12-17T14:10:58Z","timestamp":1481983858,"authorUserId":"disqus:stephen_cleary"}