{"_id":"d017d653-d0b5-35eb-b361-bf4edf584c04","authorName":"Erhan Hosca","authorEmailEncrypted":"YXKqnKSxsjpmif01UHdUSQsXAVuOnOqmB3wM0hCp5TLD4JIGpDScouV3ElkG6mNgQinaqxyZgqsTAjKkxfbB/0EqqV/+DnjyYd3zOhrJRZXHhf/r0E8SfRxu5/Rc1s2rCPKVTaK6wsaUqKwWdutRge/ltzP7uifrKlyyX8lH8q5ZRA7r/A9sFqsH3HWFmNS8b/qPZL59+bo955G+jqYafcFACI/t9ASXmfsNa/5Pujrg2QvOb0cLAmSx+p9JmxPF2yNnCIjhXKLHrajWKUIgyTvajsBTXGh/ma6jqc+f88s+IMYjSvUGGMTQfDwGAxwTVoMBkKfGGWSKijI8qW5wZ9boWKJ9kHqETUAtDgOqAB9PPZkxvfo8Yl0tfCeog4vM7eufdM7i0rZm5r+KEGdCHN8Gkl+Bh6x1xjnU95aq5LP8z5Zt7NZaZy+KIYXFe7EFkOlNWdmXlT6a7kXgWPN6Bx/Iykka8jNx7UT1qpttrtZNzLTLwvpGZO9Hc7WtlYYK0pu6dOi7HSHV9NaYnBPdOb7NBU0hyT7gvIkaBE++0HJogmSiSvX69Bas9q79mlO/HAKD7azcpk/+txAAH7zvd5tYQub1+7afTI2ZvEaCg4WSjsYiJXvyJLtS2fA9woGH7+TFr8PmR7IW+alaYKK2t1ZoYkG1BImjGDl05cBlIx8=","authorEmailMD5":"6de15a85f6dcb189fe5d743ee597f79d","message":"I realize it's not exactly the same and the purpose of the MSDN articles are to highlight usage of TPL.   \r\nThe async behavior illustrated in the article is essentially a UI/Presentation Layer concern. I can't think of another reason to decorate your ViewModel with async methods other than providing a \"responsive ui\". This design decision will have a profound impact on how your unit tests are written/structured - not to mention the case where you might want to re-use the same ViewModel but perhaps without a UI, where we're not concerned at all that it takes a few extra seconds but we're concerned with performance and would like to minimize context switches etc.\r\n\r\nI guess the point that I'm trying to make is this: If the objective is to make your UI responsive, we should handle that concern in the layer that is responsible for it. Our first line of thought should be not to think of writing async code in the ViewModel (which brings all sorts of other concerns with it - as much as TPL generally making it much easier to deal with) but to look at the facilities available to use in the stack we've chosen for our implementation. For this particular example, using WPF Binding with the IsAsync set to true gives us the responsive UI we're seeking all-the-while handling all details of the marshaling back and forth for us and not allowing that UI concern to creep deeper into our design.\r\n\r\nThere are a multitude of valid reasons to write async code, but if we're using WPF Binding, keeping a responsive UI is not one of them.","postId":"2014_04_announcement-msdn-async-mvvm-articles-b2165e1d-7e99-386d-b481-ed64583f3ab7","replyTo":"344cf908-395a-3512-aa38-abf0ba0f9c49","date":"2015-09-03T14:47:46Z","timestamp":1441291666,"authorUserId":"disqus:ehosca"}