{"_id":"79f06200-bf98-3df5-b44d-6bebb7a545da","authorName":"Stephen Cleary","authorEmailEncrypted":"MZ3qpEprQafms75KQMhQ4+OIw8R1s/v+hU1YA+P5vGuMFgz9IzUPYS8Xas1zZcOjrX1UgcSlBun3nEg4GmcCI2RWkvd2jX4wIXHmc95yo6P/0uVicCkBkD9djCEMBqxK+AochiHiab93xwwpL3983KN+iqnf06JhMOH+OoZ5JTkZw1yLVBG0uB+q/vA8zJ1rBSoPX3ftc4REXbLXiHqKaaITcPPE9hjuFBSquYVtzOJzW/axzAa0EBphhPOl5mOO/9qKCFY+VSlhQtAUkKdXrog+5jNlXvUjSW/iIML+Xf1SUyXO1ENagePSXsAngGbZoReBaF72JeKmcVZjdw4faalucQSr9x25ef5LA4GOvAhUZXnFbBfaM1WOXP8MgKA3bJuILzg/QJEWYPJCRg01+fFEEMUKrp6vrVO2W+/dMQ7+MSStbWCB5Pi4dLq8+KNqDgQOZQkgmGC8mFg3+IukMrlC+YoJORMYnBzkuH75AwpimbJL6TY/rSAZbhNX9squVMNwD+dLzBh525x64D9dJarX7hQcba79+m0wT90uYtLZIS/DFn+RBEkNTgMWJT8j0PRM2qN4xbb6zGsY7ig5JR+E+Hz9bzHYeTrpQ1yK3/AfMtzTHhtvHLCb3ps5OYeCVEgB+T+c5HZ1iLoZBDXKuMEjl1p2hpNQsuMtqR5o8jE=","authorEmailMD5":"ad2250182ff26a84dda974e50cd94382","message":"@Anonymous:  \r\n\r\nI don't include the \"if\" check precisely because the Dispose method should only dispose resources the object owns.  \r\n\r\nIf an object is refactored so that it no longer owns a resource, then Dispose needs to be refactored too (this would be true even if you had an if check).  \r\n\r\n(BTW, I did not say to use an \"if\" statement if the object maybe-owns its resource. I never encourage \"if\" statements in Dispose; an object either owns a resource or it does not. It may share an owned resource by owning a reference-counted Disposable, but this is rarely needed).  \r\n\r\nOn the other hand, *not* calling Dispose when you *should* can cause some very difficult-to-find bugs. Many classes *require* Dispose to be called, no \"if's\" about it (pardon the pun!).  \r\n\r\nSo I claim the \"if\" check makes the code *less* robust in the face of complex software processes and team maintenance over time.  \r\n\r\nWhat the benefits are of having an \"if\" check?  \r\n1. It does not help when refactoring. Changing resource ownership requires changes to Dispose regardless of whether there's an \"if\" check.  \r\n2. It does not help with robustness. If it actually avoids a null dereference, then you've only introduced a much harder-to-find error by skipping the owned resource's Dispose.   \r\n\r\nOn the other hand, I think *not* having an \"if\" check more clearly communicates the designed intent of the code. That is the reason for my recommendation (not for performance or avoiding code bloat ;).  \r\n\r\nThat said, you are free to take my advice and toss it in the trash. I am, after all, just a random blogger. :)","postId":"2009_08_second-rule-of-implementing-idisposable-7a1a789c-9a61-3596-ac63-8d78ef6528a5","replyTo":"","date":"2011-04-08T18:24:34Z","timestamp":1302287074,"authorUserId":""}