{"_id":"977dba87-4cbf-3c86-a939-e3ba5d2c2ce3","authorName":"Jeff","authorEmailEncrypted":"kXcu/sUUm3rIs3CCI10mlhBdgv4YBgR537WgnsnfsrxdZbtJMuHG62mX3bc/KpKZSZvSI5UFmHQ7PtQSua4GK8p6Gd+OQ4dim1OCAjwXXFXW+rCF/+6QtmFhHoBJw2Szdd0975MeXmhhxwxRc6GwXaYQxGv7SQqP+nhEu0DNUbpoXJY9e4zTmzBZjlcD/3/HG7vKheI2cZpgSC4YxFSwolawy+mbtNLt2oel9lCuMx5ZmwrODI0PJnWVszCDHcxSv7dY9xGIF8Hqa7C2V2vjBwRti+f1dwOVRSytuqV2P+RejaaPS9YXZjvaWidpW6Mhr+lBcPv7lixzkNBlOToPF1jfWidfnsS1l4/6Y+Kwfxv+g3x6HuDUDC9RTK+UPoM/6KJU7UeSO63PR0xRst1HIvQ2t+/aswH9JbQBb3P7/iOAbs6QY+0XUvrkJ4z+EnqNkaLOOm+FSPHbKMXo8hJvNxyVMNh7+gjv2BUbNMMUeohfpfYGLX3/uVcUht9bc0aATMKfDfCX2Ly/QVIatb48qR3YEZhpMdA0y+WOMNIaupWdBejWbmw7AIM5rrK0MsAUDNrcrhSRj22o4CXT3yvtsaA71awimN1Xx6R28Cl1645ElIgPHDzWIh3T+biNduZFZ4XqYDc4jFzXb5c1paki4WNukEw3y9Zy8Geh2kU2bk0=","authorEmailMD5":"dde3bf631a325497e9e1d211ae80dbcd","message":"@stephen_cleary:disqus   \r\nThanks for your awesome blogs. I have a question, I am building a library and all callers may not be ASP .NET applications. Do you have a recommendation on fire and forget mechanism to do some task asynchonously and not block current thread?\r\n\r\nHere are some options:  \r\n1) ThreadPool.QueueUserWorkItem: Simplest approach but doesn't let me control how many threads/work items will be created and there is a risk of adding too many work items to pool (I am assuming number of threads will be controlled by CLR/OS). Also, the API I am calling inside the work item is a sync API and there are chances it can potentially hang and QueueUserWorkItem doesn't provide a timeout to kill/cancel the task if it is hung.  \r\n2) Task.Run: Provides a way to put a timeout on the operation but not sure if it puts a limit on number of threads that would be created in parallel with every Task.Run - can we create too many threads due to tons of Task.Run?  \r\n3) ActionBlock: Allows limiting number of concurrent requests through MaxDegreeOfParallelism if same ActionBlock is used for fire and forget but doesn't have a way to put a timeout and that puts the risk that task I'm running can get hung - same problem as outlined in #1.","postId":"2014_06_fire-and-forget-on-asp-net-006b7bdf-c89c-3ee5-bcd5-a85f62b3a22c","replyTo":"","date":"2018-03-02T04:02:06Z","timestamp":1519963326,"authorUserId":""}