{"_id":"35b829a3-fa7e-314f-988d-aeda3b3d8b1a","authorName":"tiagomargalho","authorEmailEncrypted":"ZdJXacYVkaapS3wcaAahFCICAaE5U+eq8zgfnlovhHY/la+Uxyxtg3DVNJSr9izTiIMxrOTPTFfzVgwAVJ/ZDdm0T2lsdv/80PX+W/aM50jv2QdZOJvDTVHGWK08w5Fq0HAvLl/FBzaIvGxsO8yLZzaUbqbTskxIJtwJXyqv+BrPASUul4pypKYYSzuu5lvBB4nuAYv4hy1tHdrAIDQK638FwF4DZj9Unw+OMEFISEn01Lec5F7ii0VepXORckdX5q5S53VtrHZAmyddnJuwBq5I7MS8B+/jZT2QwUHiVu5zMs7cCAka0AFVy0uPP3GhaWqeNKxw3xn9KQFUGPMxhj8e7W3T2ykrUdSPslT9NbW2N5v5JKCNXD1xDhx3YMJ1lPv9cVryYrJp1G4Lf2g/2UbQOaGUQgILFeVthPA4d7KtC03R5O2cj8cbHv5YjBfw8d8LA4yYbyh0izTJl60w1aA1Bc3+KW/1utCw1p03S2R0WEToCRi7+CZDYawqsy0r7PnM2jN+QpCTAnXXtiWbnZZJ08fNp7DrnK6lA5K114ruth67BcOecXxwRMwEKMXc++SBqdK7ikSHGzF/XyPVBy5hBA1xGL00G/0srVQWdO7LKdnXSUUY0t1uHNIwZxL/Y8JZEz+A12TFITV8bEGWsvzZj9DDZaOCC5rCbjcwHbQ=","authorEmailMD5":"59e75e71c30cfc730d146ec630fb89c8","message":"Hi Stephen\r\n\r\nCan you please explain this paragraph a bit better? \"I often see LongRunning misused in particular. In the vast majority of situations, the threadpool will adjust to any long-running task in 0.5 seconds - without the LongRunning flag. Most likely, you don’t really need it.\"\r\n\r\nAre you saying the thread pool thread will be \"promoted\" to long running, meaning it does not count towards the thread pool limit any longer (and it's not used as part of the pool)?\r\n\r\nI don't find any text mentioning this behaviour. The only related information I found was the thread injecting behaviour of the thread pool: \"The .NET thread pool has an opportunity to inject threads every time a work item completes or at 500 millisecond intervals, whichever is shorter. The thread pool uses this opportunity to try adding threads (or taking them away), guided by feedback from previous changes in the thread count. If adding threads seems to be helping throughput, the thread pool adds more; otherwise, it reduces the number of worker threads. This technique is called the hill-climbing heuristic.\" from [http://msdn.microsoft.com/e...](http://msdn.microsoft.com/en-gb/library/ff963549.aspx \"http://msdn.microsoft.com/en-gb/library/ff963549.aspx\")\r\n\r\nSeems like threads are not promoted to long running, but instead, the threadpool will increase the number of threads in the pool only if you get more throughput (probably applies best for I/O bound tasks).\r\n\r\nApologies if I misunderstood what you meant.\r\n\r\nThanks in advance!","postId":"2013_08_startnew-is-dangerous-4c5e3290-63e6-3320-85d1-3054cbca80ce","replyTo":"","date":"2014-12-02T09:10:12Z","timestamp":1417511412,"authorUserId":"disqus:tiagomargalho"}