{"_id":"d588b275-2448-3402-b9a7-ba0234100d6f","authorName":"Stephen Cleary","authorEmailEncrypted":"smAehiRx/wfkw9WzFrD2TuIAgNFOQBRICy8+E/EQiOunOjEmD0wyjSshaj19zmxX3eO7magRFwG/IrftRdLs5/wUJFI+zUYbJp9EUwxKOIZmjypfKOVbBX8R9iciAsQMYzJay7PwOx7KfimLZ6wXaxbvcIGo10eRkKcWX7dY8x9KvwzerX/2mSVjUudzlMKw1J5PYL6nJ2Q8ju6pHIi5OoVcbqTKkNJBDWCVEHyxtVNfSiMue1XC0np3lF7i3MLmJxX9pp0yZAUKrAaYC5Plq2sS+o9atdN5CLxuB3h0Kh51TpO6R3y7r+8vbpXf55PeSynRbq7qUWuKZikHKiOAb2A/FjoPlxZXDNaM9pMSJU+NUxrqLLb9ATCKBDNCvo3V1KxZSo8s8U2LosIpKYnz3A86id0RwYICQMe/qYd7ArFfuB3+peFVYgs06W6QseJB7fJODkM6dl4acYPjcts9rqlZLzRz1ZiZAvoYMLL5372NI3/mnFIl5SPMEppYiea770nq0zZHsRdfDRw8Rwgb1JvRjGb1DhbFkoTTyaitHWKe4PzOuEaUEBsgcUjmgBGbw7a/CNMDG6PgURJLzggIRA0SQMgrutP6WXnCEur4FW9V9AV05J964fORlZHAxLzwD5eH2OhO3sYTR88LOPO7aPDkunCGO2qQOCTBho8rlog=","authorEmailMD5":"28dde5772b48c92e08b8050411aa5ba8","message":"It's not just UI schedulers that cause this; it's any usage of StartNew/ContinueWith when there could be an unexpected ambient scheduler. I did run into this with a UI scheduler many years ago, and I've answered a few SO questions where others did the exact same thing with a UI scheduler (so it's not just me :)\r\n\r\nBut even without UI schedulers, I've seen smart programmers run into problems with the ambient scheduler. I've seen it happen in code using the ConcurrentExclusiveSchedulerPair, as well as the old StaScheduler from TPL Extras. The ambient-scheduler semantics are so tricky that I'm aware of multiple code shops that wrote their own code analysis rules so developers *have* to pass an explicit scheduler. Which I think is a great idea.\r\n\r\nSorry, but I've seen enough people bit by this that my opinion is still that the StartNew/ContinueWith overloads without a TaskScheduler cause developers to fall into the pit of failure, rather than the pit of success.\r\n\r\nNow, if you're using StartNew/ContinueWith for dynamic task-based parallelism, then sure, go right ahead. I haven't written anything against that usage (I still always recommend an explicit TaskScheduler, though). I guess you could say that StartNew is dangerous like a chainsaw is dangerous. But if you need a chainsaw, then you just have to learn how to use one safely.","postId":"2013_08_startnew-is-dangerous-4c5e3290-63e6-3320-85d1-3054cbca80ce","replyTo":"2acd6063-f7fb-3482-89c5-63b0a87628bd","date":"2016-07-09T01:58:35Z","timestamp":1468029515,"authorUserId":"disqus:stephen_cleary"}