{"_id":"68d31e77-e57d-3fd3-81a9-15c587762dd5","authorName":"Anonymous","authorEmailEncrypted":"MxKzIAqD0nT884FCPy/78rMxjWZQjkYuGE8gmuVO+MiMtn/cqwpE6o2NxgWkQqlT9+Fojow2+Z+Dk4bTVP9Bh258vlr8k5c5PzcxJzl9l9EjVRTy7CWhFJdG1ZrqmL2bAF4sauEWVZxq3PX9svkbJRbS3iUYAKPLSOB4LrrWjmY4Hr/V3M2dSFbkSaTVNjJx4SeHlKuzTfuofseTAPEGeehVgYO6kfB4iSzbasoGcIbBrq+JMw3aEUEHSLU2svxD+AtYhzYLrlO7vFJYmCGVY9+p3WeA+dDG07AUxKf9glHvMvUJ7xC5eoMcIRGUCUGZ5B47UJfsLCLWCz3bX3l1Vj1aCF5gRnJIm+3ZiaLaeigjqlX+7RWTnIOD+qGldIJf86cBgiHZ4vBt0zNBJX5BB/seJVRaCZfj+HSGDGeHrX5CthYDUCsTroKRDTim45J2kaBiVqT9lMNJhLREvmBMezNbWkuuVVlzRwtg74IaBG73dxrqDD4nnYUMtDjLFLG5ODo01akYGFB2l7R35se+JosBFIOq7T/+kYAVTEwwCEkRZlzOqtuM/HmgLC17UBy1ZhAdSoNodFCNIfFPMkf8kqAdfg/a3hLBuuhpGVy4STI967sNi61E+39Wrz3X96QjKixaLFqDPmbxUXoZm4N+GJgEw6WqFnqRzz3bdOzsqis=","authorEmailMD5":"3cb42db01b5edab948a576e1bf94a281","message":"Stephen,  \r\n\r\nThanks for the clarification. Network programming is totally new to me. I think that we are talking about different problems. It seems that the purpose of message framing is trying to break between messages so that the receiver can extract useful information from received stream. Is that right? In contrast, my problem is how to avoid data loss in TCP/IP transfer. My tests showed that the function 'send' couldn't send a big chunk of data a time. I had to split it into pieces and made many send calls. In addition, there should be some blocking mechanism to make sure each call is completed without errors before the next call of send. My trick was to ask the receiver to send back a confirmation, which seemed to work for me. But now I am concerned since it is not quaranteed to be right as you suggested.  \r\n\r\nI was trying to develop a class for my parallel computing applications, which actually needs message framing. Typically in my application, the server (parent) reads data from disk and sends data and instructions to clients (children), and then collect results from children. I don't want to use MPI since it is not robust in handling individual host failure. Do you have any suggestions for this kind of problems? By the way, I working on Linux system. Are you working on Windows? Thank you for your help.   \r\n\r\nJuefu","postId":"2009_04_message-framing-35559d4d-46b6-383d-ad38-3ed5391f3894","replyTo":"","date":"2011-11-22T21:09:34Z","timestamp":1321996174,"authorUserId":""}