{"_id":"3401c15d-d0d5-332c-b804-48723e4d3c8b","authorName":"Stuart Wells","authorEmailEncrypted":"gp4khbB4QH9TlPPIV90bowqvBUqwZWiZHjhLebo0Ws5UELqvG0I0y5so6SVlHJJ09gn1/28x7AqRlyBQasU2m2TehavPSx6+3I6eXjXffFQ0VbzdGuzeWIXBMbzubOjJdVp9qa7WRGh2/TCUcIBv4SNYjEYlPQJyDIkUrHZL8MhKN8b8GPGtMo57E2j2yLy5QsqUstcqYggFst8Wxt1b/RXvG9GG5kqjAwt4EWY+8u0qY7nHOuZfLYSu+9pUlGQ4mVNrDv6Fe0OlO+k4CjiGe8ec6W1F3pCVr23sQt1NnucjAJIDgz/67CRRN/L7c8s+mxembuQ822MYOwT75i3bGKXCahkYDC4T5C0haHvRQceN8wJmkOExPpz4VI+eYVUo/FdlCP+P3IiSD/jdTDpAUHX5FKQDsa8V3WuGrZ9iLiWoBlptiD0NTaVjCjXR8sg7CRVvB/9uP2Ti1njzmiLvM5F8mzaMy9uc//nzvmr9EQmZ6zsc3W3G1sz92P0s6dDqyvNXdUYi+UpkX5RQBlQLy3PaOjOc2sA3tQ8mL5N0sutyB0USf03fiMXSG+pFZnCi8QuhM9/+PYj5WaQi5/6drb0BvWg2ptQb798zQuMYxB+YllBzKhvR1uNCw5POlKa8rLArYytrJniopjXhd1uzfkBxNR3cfhAq2bHbyhIULyQ=","authorEmailMD5":"1f7d6a407bb7495bb3c9669535bd0327","message":"Thank you very much for your response. I did however glaze over a bit trying to understand it.\r\n\r\nMy understanding is that I want to avoid using another thread from the thread pool just to be able to return a Task for an activity that is running locally but may take a little while to complete.\r\n\r\nMy WebAPI controller code might look a bit like this:\r\n\r\n public async Task<ihttpactionresult> Get(string id)  \r\n{  \r\n Widget widget = await this.Repository.GetWidgetAsync(id);  \r\n return this.Ok(widget );  \r\n}\r\n\r\nLike this because by the grace of DI, this Repository may be CPU bound (my example) or IO bound (webservice file access or RDBMS). It will therefore work with any implementation as long as it returns Task<widget>.\r\n\r\nMy simple implementation is essentially running like a cache (the implementation loads an xml file on construction and then all gets read from the in memory XDocument.\r\n\r\nIf I understand it right, I don't want another thread to be used to do the repository work, I just want the calling WebAPI request thread to feel free to handle another incoming request while it is awaiting the xml query to complete. A bit like a UI thread handling drag/click while it is waiting...or do I misunderstand something at this point? I do feel a little confused about the availability of threads in the pool to handle requests - if the thread cannot handle another request while it is awaiting then there is not much point in trying to be asynchronous for non-parallel activities.\r\n\r\nIs the following the correct use of FromResult?\r\n\r\n public Task<widget> GetWidgetAsync(string id)  \r\n{  \r\n Widget widget = null;  \r\n //...some code that queries an pre-loaded XDocument, populating widget  \r\n return Task.FromResult(widget);  \r\n}\r\n\r\nOr should I place the whole body of my code in a method and wrap that in TaskFromResult - I am treating Task.FromResult somewhat like widget.ToTask() if there were such a thing?\r\n\r\npublic Task<widget> GetWidgetAsync(string id)  \r\n{  \r\n return Task.FromResult(this.GetWidget(id));  \r\n}\r\n\r\nIf I use the async keyword I can just return the Widget directly although it complains about no using await. Omitting the async keyword won't allow me to return the Widget directly, I have to use Task.FromResult or Task.Run, but the latter causes another thread from the threadpool to be used, which I now understand to be a bad thing.","postId":"2013_11_taskrun-etiquette-examples-dont-use-a63e8aa8-3250-37a4-990d-af802d3197e6","replyTo":"ead0957f-fdf9-3f6c-b5f1-dd4bf3811bc8","date":"2015-03-27T15:20:01Z","timestamp":1427469601,"authorUserId":"disqus:disqus_2cbnUKZGU1"}