{"_id":"ead0957f-fdf9-3f6c-b5f1-dd4bf3811bc8","authorName":"Stephen Cleary","authorEmailEncrypted":"Fhcv9oAIHxTnPfvP1xC6uqeWYOBPInz2jE3lKdXlNZWLiuw18Abipz7FywcFeeca3pN06w7kK2eJDITGYhG1s+9pC783QD0nMh6FKAWMydBNNN4QmbhdxgBKefuBqp56gJAUFX168g3WkI6Ht1Vr46h+or4vZ9vmbVFqkZ6Qtl2IgvZpkiQYFoCyYoKyKbVe2pUixF9zotolrM07nPgJZT+Wn1CTpOUDIXUVddHQNat6/EPFMcqI25fz9WuNhvAv9BcAKwETSjQ011G0IW9pWdj27jMwhsbAlgHyJEE8NlyzXvVn2xTqFncwD+V5NhtHz2vqPL3uTKG91dHii+7IFsjtle6CMMSirsL8FgIdELNgpiRS9y+6dnihIoSv6nfsDEm11zDM75cbK4WG+LDglsNlHon1q0747jk5X3Vz5GCFRo509DBFN+6FifAaiCw6e8Jh0QLuPnWEzH/R5r3Vv1dngq5BLKNyuMne79THLsX84oN+ECLrXOeZtA9LhBnI8E78RhIHhyEuOfo3DJawDv2u+VxBSWx1VQ+yuRQMCzls5ff2/vuQGRotRxlRclWpUoSlMVWLXTxNTPhrVvamVb1pREq60AhB5TictChV7AgZVNMDjq352kp6U8CfRa7XdM+046XF0yBJ6vB5ZkoTuCOklc7Bf+hGJnmLwt7tDvE=","authorEmailMD5":"ad2250182ff26a84dda974e50cd94382","authorUri":"http://stephencleary.com/","authorUserId":"disqus:stephen_cleary","authorFallbackAvatar":"https://disqus.com/api/users/avatars/stephen_cleary.jpg","message":"The problem you're running into is due to async forcing a leaky abstraction (similar to IDisposable). Your interface must determine whether its implementations are naturally asynchronous (just like with IDisposable, it must determine whether its implementations will have unmanaged resources that require freeing).\r\n\r\nSo, there is no perfect solution.\r\n\r\nIf your implementation is all in-memory - and presumably not long-running - I would recommend the Task.FromResult approach. However, if your implementation is blocking - i.e., it really should be asynchronous but for some reason it can't be - then it's up to you whether to use Task.FromResult or Task.Run. Even in that case, I'd lean towards Task.FromResult, documenting the type well that it's actually blocking and not asynchronous.\r\n\r\nAn example of dubious Task.Run usage in inheritance is the BCL is the Stream class. The asynchronous APIs were added after-the-fact, so Stream could not take the (IMO more desirable) approach of being async-first. Instead, Stream assumes that most of its implementations will use blocking code, and so they made the decision to make their default async API implementations use Task.Run. MemoryStream - being synchronous but not blocking - overrides these asynchronous implementations with ones that use Task.FromResult.\r\n\r\nIn this case, you don't have a backwards compatibility constraint like that, and IMO a better approach is to only define an async API in your interface.","postId":"2013_11_taskrun-etiquette-examples-dont-use-a63e8aa8-3250-37a4-990d-af802d3197e6","replyTo":"0e2021d2-b737-31db-b698-be091e997d94","date":"2015-03-27T14:05:25Z","timestamp":1427465125}