{"_id":"ab74d4eb-bb78-3a13-a22c-e53900c85f66","authorName":"Stephen Cleary","authorEmailEncrypted":"ilozPU5xkB/sRxDuGnekHfHFF9/kUFVXrmBgPeyLfcZFPpmepU3nc83MTenQiMfYwzj/KCKv6Aeeg7jn0wdRr3XnJXgjXAe09MFNu5P8Ydk2EfctlA7i8RU8DDvqsxrvIrmCT5+v/laV+ayMGOjuzzgpY3lk0lVgA1Jh7gOk0aRfaD5uYU1IsLaE6eMPAfoxDQ3IOAC2xWFtUKhFK+OfJayxYWJAIAuGH7N2WD0qTemnqDch2SS2st26hDSyJPoYMYe9vQ01buIlgrtgNMQkFgTiGEADzSlX2pFg/lg6TkGVbxm46QI9gIblGWUN+IlI+bg+V0T4vNMpC0lhIyH6Y8JIiXw2h6Uw3H7i5E7JapOAuBdFeEP4K3fDnmgAg6NoXB8oPxMG78fBUP/AIJSl9tC8zWQDYeLq7d/vxFzA4Eo7YZmYQhIPeKFXMX/l2b4NPLFj2xCTTQZMAmUV/kR5XcBPHCIfYexCFNT3MsA6mVRPsq+hjbm/cBBdNctrqS9kEXOS+3A6slKBv8NZNNV2NiQl2yx1xbK/r8xunb/6ko68s8j0UyCkv1wF8j5G/nmU/LVGP6LkdjwKAjJTHDeCe0R7Zxse3GulZVEAlmoBcHGCIxxH9VCKnuZl139/atwT2g2iDD6SZyr0rjU5wy0u4wW2qxh7P6tFBvcZ6zB+VyI=","authorEmailMD5":"28dde5772b48c92e08b8050411aa5ba8","message":"I think you mean that asynchronous code will also have the overhead of a thread context switch, and that is correct. However, it is preferable to blocking.\r\n\r\nIf you run a CPU method directly on ASP.NET, then the original thread executes the code, and then continues.\r\n\r\nIf you await an asynchronous method on ASP.NET, then as you stated, the current thread is released to the thread pool, and when the method resumes, a thread pool thread is acquired to execute it (which may or may not be the same thread).\r\n\r\nIf you await a Task.Run CPU method on ASP.NET, then the Task.Run takes a thread from the thread pool, and the original thread is then returned to the thread pool. When the Task.Run thread finishes, then the async method is ready to continue. (There's actually an optimization here where the thread resuming the async method *is* the Task.Run thread). So Task.Run on ASP.NET will cause an extra thread switch and throw off the ASP.NET thread pool heuristics (since there is a thread pool thread used to run code outside of a request context, and then returned to the thread pool when that work is done).\r\n\r\nIf you block on a naturally-asynchronous operation on ASP.NET, then the original thread blocks, using that thread (but doing no useful work) for the duration of that operation. When the operation completes, then the thread continues.\r\n\r\nAwaiting asynchronous methods will cause a context switch, but this is almost always preferable to blocking a thread for the duration of the operation. Yes, you lose a few microseconds of time (asynchronous requests *are slower* on an individual basis), but you gain significant memory benefits as well as faster responses to varying load, which enables much more scalability.","postId":"2013_11_taskrun-etiquette-examples-dont-use-a63e8aa8-3250-37a4-990d-af802d3197e6","replyTo":"3ca897b5-12ca-3eb2-ac0b-82b5234657d2","date":"2016-10-25T21:01:08Z","timestamp":1477429268,"authorUserId":"disqus:stephen_cleary"}