{"_id":"bc813a6d-7eaf-3938-b500-3ce5e92ac48b","authorName":"Filip Cordas","authorEmailEncrypted":"YbPF7kxVuDr6CmlKTnpHtWbJHM1l7YLvHiLvV8C8vthSuJ3RNR1hRQIJIqdnIk08oN7BE1IdDEYr0au14OmvfERXdBVUVuOioAyQh2/7MNnnm9YA0GoDd9dN6FrZATj+dKSElgrqgsw6ObfssdXc/a9lU7/igeRpcDvBMLiAoOj5ByocpudXP7VKUjDlrTh5RUMRpUiZEIHEwwxoFjnTp5Naew0bdvJiBcQD2oi7lpRn5lFrCyxnq3/Lge8ove7RgbADRWY+65N+k+GT7FBNp3Devd824M/qEF0G0hKZM1FWwA9In3tyN6gvnnJK/o7hy4ID7f4uKgSc5rVAcPiLgbZMenIDKGXTCNk2RJ+v5tAXbGSs5XV9RDY4WdYfALCUNNSVR3ErLzYl3pMzcdNswqNbbf0RBDF8ENwreKnJTV+RJntxDh1pCzjNbbUr244DjYDnAYqR8D7mM8Ib+tbjykCsmtASoRTNpknY9Ju0t4Y3DK0NBKPVpKazsFGkoEkshVoBJtzaLihEuaPy4lDJSGRFB9Z11VP3arA9rlzmiGpQ5GGR0Q0LqN+J0KR9iysLOPZvEqrDpqQPiuzoyMHhHgGSfCLvivhI0OrgGgGA9KvA1TD/87Qo/TstfpYlFIYmVQtQhuxiM5w+e7Am7WRAwzmLHeKvZrk+7lfCj2JguNg=","authorEmailMD5":"5a0f72bd57a0cd7441313cf75d048196","message":"No I do get what this post was about I am just not sure if this is all that of a perf issue and should be avoided because of that. I mean linq is slower that doing things in for loops but I won't stop using it . Do you know of some tests that show how much of a drop will you get under high or low load? From all the tests I run the perf drop was minor few milliseconds per 1000 requests I didn't do anything to fancy just simple calls with http get on the same machine so I might be way off. Creating a thread will have a big impact even in the UI example it will in fact run slower then a sync call, but if you have a multi core processor it will run in parallel so your UI won't be blocked and it gives user the appearance it runs faster. But when it comes to ASP.NET the new threads will all use the same thread pool so in most cases this will just reuse an existing thread and not create a new one. This dose have a perf impact but it's not as big as real thread creation. And I was just wondering is this a real issue. For example in a single thread javascript timer function was used to split an execution loop in other to let other operations use the processor. Even in c# parallel != thread for really intensive math operations that can be run in parallel you have Cuda and other graphic engines that will run much faster and they don't use threads.","postId":"2013_11_taskrun-etiquette-examples-dont-use-a63e8aa8-3250-37a4-990d-af802d3197e6","replyTo":"36b0a164-4433-3a2b-a0ed-efcded40dac0","date":"2017-09-27T16:31:57Z","timestamp":1506529917,"authorUserId":"disqus:filipcordas"}