{"_id":"d8b2917e-f565-39c2-a220-208434f96c90","authorName":"Stephen Cleary","authorEmailEncrypted":"djKNWN04kpOjjkHrgY0ngbBzOGSA4fdmGrr3XdHPsBVTIbi0Bo7Dj+OCE+2U3E/IG0fKB2DST2UtqHzZClwVyfBigrdq3zSAYzFt9Zk0+W0FdHD1L66ew/gDocltb/ZlMO/9krHRYTZ8+LhKtNWQrbw2ssFD6fjd3xErTT9ttECc29LjlGvy91b2FSh96pO5hA76HeHoVVDSjrkl16ImrURgYyZNmNWPYJee26Vq8mYIjVRQ1NhUXS/T8UH3B5WUIHMz5XmGZMvHi9jE458i3LO+Qe0k73/YwJY9BVZHPDlgfziRdvOTCWSCzPIbvTsj1cRRF0dunxpmhnvSavQeBy0Cpz+AYoBVEy3M9rW/35KMUuitvSdYoXOPSwkxp1aevSPPwSTYBshp7yRxTW6JFovkSjfe5RK9PU7VoSawYeDH8iR30PNqyLk39ddEvGonE/SCpsH46dBxEvwl9NtCFTH9P88FSdLOqZpi8CqaBWlTChFlUzqz2wlyqvtJrX1zy86VFgiQwM4aWJkmCdbasCThxANxqk+/xHOJPF9EpMFOoA2fEMY6hyxsBoJTjtP4FMXDg2Pc40SwXqjCyXV/bgLlhA24YeztGGTIdZnlytsgBLTKWV8k2ge6l3EgGPlbY2h+FFi8NgXIKgX1GPxm740nTmhn8uXUtgDkskaeY+A=","authorEmailMD5":"ad2250182ff26a84dda974e50cd94382","message":"CPU code is fundamentally synchronous. It must run somewhere, so it *must* take up a thread, and this makes it synchronous. (In contrast I/O code does not \"run\" - it just waits for a response - so it is naturally asynchronous).\r\n\r\nSince the code is synchronous, it must run somewhere. If you call it directly, it will run on the current thread (which is bad if the thread is a UI thread). This is why the UI thread offloads it to a thread pool thread.\r\n\r\nRegarding \"Would it not solve the problem of blocking UI by just calling the calculateMandelbrot() using an await?\", I'm not sure what you envision the code to look like with that approach. You can't await something that isn't an awaitable (e.g., a task). You could mark calculateMandelbrot as async and return a Task, but since that method has nothing to await, the compiler would point out in a warning that it will run synchronously. You can avoid marking it async and return Task.FromResult, but that's just the same thing - it still runs synchronously on the UI thread. You can stick in random await calls with Task.Yield/Task.Delay, but that's a hack (dependent on client hardware) and it's still going to run all that computation on the UI thread anyway. Or you can wrap the entire method in Task.Run, and this entire blog post is about why you shouldn't do that.","postId":"2013_11_taskrun-etiquette-examples-dont-use-a63e8aa8-3250-37a4-990d-af802d3197e6","replyTo":"dbe84c1b-38ba-398d-98bf-f5fe98efcfe2","date":"2017-01-29T18:37:25Z","timestamp":1485715045,"authorUserId":"disqus:stephen_cleary"}