{"_id":"18c97043-18db-33c5-bb6b-a0ebfcd282ca","authorName":"Stephen Cleary","authorEmailEncrypted":"X6eJKEwqd1Uivt2dn7DlzaKBBe0xjt0kBEyowosBE8vsAEM6c3q+WdsZvUPxYl3/tczzg1Xn7WuCZKm+tKmLGkYlxQ7ev5Nsyhub2BGJnKqY/ySb8ges1dbR/79jq+RB3IiszjWACm/ySFwJQejYpv5NDvL2zIVRfC2V5IVD4mcZS+AjTGYdnfs+MaA6UjYcKap2Xe3aGqLMEjzAX8nuFY0YPqX/iHAozl7jlXknlaI54hMHlQM+OEUKpiNA9rPdrx2OfhZIC++rIubMVzjU2qnz9BnU51BHBE2SH0O/yrLBYtS4n3oxRpvnFgQsKpsmH8qgypDEJJ3qJIky0ykIfVKIx5PDeB+3BqTzXdb1VrfGyQz7cwpzDL+nyZXiKBcqiSN5zZWKNVw3jVWJMRbrEbSJlfl4giKFYRGa3iu5whwyW4PnKd9mkYJzszDHaJSmEcuFjH+XCdGjP6rNNErkRXvN6x6p8BxlmjDx+HEnXpqlDuZwlZqV6o1GTEWxicwigpTH0C0gmRj+LPd24ROlz8U92Dh7+3EsVubIUcfAF6OWe54m04EyJ12YRb8UeM1s9kPHi8PUJXk/oqUHy7q7N6L4leOad60VqSC/dVCBCR20Bkzmv3jaxB6FmSINvrB28JCfDK7nGpJ4M4XPUb1OTGk6tFrn7YWVg6iKUm8zVmY=","authorEmailMD5":"ad2250182ff26a84dda974e50cd94382","message":"That's a very valid argument.\r\n\r\nAs a counter-argument, I would state that there are other signs that can imply whether the return type is a Promise task or Delegate task. For one, Delegate tasks are usually not returned from methods; instead, the standard approach is to use tasks only as necessary when the work is being done; in fact, the Parallel class and Parallel LINQ remove almost all need for code using Delegate tasks (they are higher-level wrappers that use Delegate tasks internally). The small amount of use cases that actually need to use Delegate tasks directly are situations like doing CPU-bound work on a graph traversal, and in that case it should be pretty clear from the context (type and method name) that the returned task is a Delegate task. At the very least there should be some documentation regarding whether the method's task attaches to a parent task, how it's scheduled, etc.\r\n\r\nAlso, there should never be a reason to end a method with \"Async\" if it returns a Delegate task. The \"Async\" suffix is a pretty clear indication that the returned task is intended for use with await.\r\n\r\nSo, is it *possible* that different task types can get mixed up and cause problems? Certainly, but I've never actually seen it happen in practice. (That is, once developers learn the difference, and which type of task is appropriate for which scenario).","postId":"2013_01_async-oop-1-inheritance-and-interfaces-65a8e6d1-bcc6-3bb1-9b74-3323eb40448f","replyTo":"bf73d638-4709-33c2-81f1-3bc30adb89e1","date":"2014-10-27T01:14:36Z","timestamp":1414372476,"authorUserId":"disqus:stephen_cleary"}