{"_id":"37ea80db-2310-38ed-bca3-1e1ed36b6213","authorName":"Scott McKay","authorEmailEncrypted":"KUI1FlMuBri18Vjf3g9wb7ZbK92oFMxoMIgvG9r2/dm1rFlGe027pSMkGMHvvwwAiSt8XYfhaX8Si/JT1ooAq+fwcUdX5fc7yRphSWCOdiLMNvhon33sgWeHUge0C4WVFpcGfaf3FznDflqx8gCpW6Qdnbu4nceF1DB7nMhQyNa4EfNfAtDJG54Jf9s+jwPm4N8N+9z2U7VcElAHUu+1Ke4iCtbcMd40lvFGnbWlPEf7YoNpN8WzGMlJfgb9Ntf1qNfaerLzkPPGrYd/iRrOjuk1xsKhkEbXx1f6mg3azujVEsJFLj+Q9/BWEVaBMGkxscFiTXfX4t1oHr1VpMhriGxMnABX5J+giogimnh8pSTdbm16hSQc0ePA8wMpQWIL9/3At+VKJxnPN3Eyvet/+jO5iY92/Zrh33s5YfGKLKYb1haz5awgce8Bq6netN7EaAK/7g0r7OficMyZ3fAymk+fc/r6tswg9lWJOWEiP6f9dZ6tndkCnxDWC6MTNRPre10yEvCKCifTa85I+qdVX2gn0spoRQHDqNjatQyQ1XfY3SFfw2I6bCxVLnwKgPWcWbsGHtGjKx5f/cWvPnkrcfNFy/cmPx5bogx7TMQ2TEkAnANtYeFapMc/0LZRIgKNZRr7DwSCTyda/xOH3tL9WCL/xJsVDn9hTdsgu2miixw=","authorEmailMD5":"384d2327b00c037623207507e3a14cc7","message":"It's a low latency service. Letting them run synchronously costs me over 1ms per item in the batch. By firing off the subrequests on separate threads I can complete an entire batch of 50 requests, including a call to an external system, in 10ms total. If I didn't care about the latency I would definitely let it do its own thing. Obviously there's a cost in running more threads though to balance out.\r\n\r\nI'm using QBWI to fire off the subrequests essentially as completely separate requests (an OData batch is just a way to pass multiple standalone requests at once). I wrap that in a TaskCompletionSource so that they're not fire-and-forget, and use Task.WhenAll to await the subrequests completing. I could equally use Task.Run for that, but I thought QBWI was more standard for ASP.NET. I would prefer a bit more control over how many threads were potentially used to process the batch, but I'm avoiding adding that complexity for the moment unless I need it.\r\n\r\nWhilst I run all the subrequests as separate requests, I attach a helper class with the AsyncBarrier to the request properties. When all the subrequests meet the barrier, I combine their info so it's just one call to the external system. I run the subrequests as standalone requests because I need the WebApi OData processing of the request input and formatting of response output that happens when I push them through the non-batch route.\r\n\r\nObviously this is very specific usage in a low latency environment and brings in a few of different considerations.","postId":"2013_10_taskrun-etiquette-and-proper-usage-fe7a94d6-0c34-3e54-ab2d-97969a27b041","replyTo":"1d9750d7-a733-3c8e-8639-c02c3baa6c08","date":"2017-11-29T21:45:55Z","timestamp":1511991955,"authorUserId":"disqus:disqus_U6noZg42Is"}