{"_id":"c09e7fb4-6444-3378-a975-c1126416fd86","authorName":"Ireneusz Patalas","authorEmailEncrypted":"T0YavoAqgx5ESc667H/f/nIuAKPqhgShFUIh3xT8sgcnEyoxAUo9l+7bZgpE7QxVu2umkuPZAiwIcOm3xmaxy3eidJv1a4bHzXdu15hDe5Bmdse22qLhq0/ga6709xJeqc/xerf5y2DGI5VETKOnOyjABn6Vum21OOFWGB+lnFAdVrPeyii3yR4xwYwJbXV4YQ/4+4d9VWvG+IgeS+lNv6F/q0J5P3ML61k5jRJqQ9RosclhNaj5Wx8uGF/lIzJdoQalmW/nsEULbMuS9B5f3h4pADCWIdoZt9NbS7d2/Vp9yKKg5eEd0QBY+RXe8jKlXJquDpRnaKdwOAN7WvGxs3uSjL0Yo/MqYSXr7ipsjp/8hpVE2J4xTxNEDg3Np1iAS3zqoBJMm7r1JpICP8Li682TAPyfM2r1bIUeu4Jc7zMcOnoDG7VIs4dl6n5q2GZez1JblKbR6MjqUK1FQhEYjie7+LO/uWdWhosD38K5lsHKACemobJeDRPMIChOkZFdFIL0ypq0l9iEODZhTGQHbIXTd/gzoioA9AH5BsWrXNFKlcZz3FEf97Sp4l0mHQ1+lFks6sPiOkaHFypCu2iPIf4e72e5+OHKGQx6Wk7CCRllk7vklUXwUXrCx4R4e7JqT46UHXiYN6XslX3kggWPRK9JWSfNKErQ6S6u9jDLSEk=","authorEmailMD5":"3892e1206cca25d573ebb7cd198d6a69","authorUri":"","authorUserId":"disqus:ireneusz_patalas","message":"Hi guys, I'm just struggling with the same problem, but these hints don't help. To make sure it's nothing else in my application I've isolated the problem to the simplest code possible. The inner API is very simple (created from wizard):\r\n\r\n``\r\n\r\nThe outer API just calls the inner one and adds another item to the list:\r\n\r\n``\r\n\r\nNothing fancy so far. I thought I did the async/await handling correctly. The point is it begins to choke when I try to make 10 hits to the outer API at a time. I'm using Fiddler for that and for the inner API it works flawlessly even with 1000 requests at once. For the outer API which is calling the inner API under the hood it goes flawlessly for about 5 requests. For 10 (or more) at a time all of them stuck for about 100 seconds and then fail (sometimes all of them, sometimes only a part). Those which fail do not return any response (*[Fiddler] ReadResponse() failed: The server did not return a response for this request. Server returned 0 bytes.*)  \r\nI've already tried with single instance of HttpClient, but with no luck. Any idea what could be the problem? When I do the same from console app (multiple HttpClient calls in parallel to the inner API) then it works fine, so I guess it has something to do with thread pools being used by ASP.NET. I've also tried to reproduce the problem on a different machine and it's the same. In case anyone wants to try, here is the source code: [http://www.fidek.org/WebAPI-HttpClient.zip](http://www.fidek.org/WebAPI-HttpClient.zip) It's a test project, the url is hardcoded, so you need to modify it to your needs. Just call the outer API multiple times at once (Shift-R in Fiddler on the request - easy way to replay it given times) and see what happens.   \r\nAny help appreciated, I'm struggling with this for a day and can't find a solution...","postId":"2012_07_dont-block-on-async-code-abe2d9c7-c3e9-3ed8-827c-021686fa2310","replyTo":"","date":"2014-10-30T12:38:20Z","timestamp":1414672700}