{"_id":"11a5ad5a-a039-373a-95ea-9cb7d8cb8d08","authorName":"Stephen Cleary","authorEmailEncrypted":"","authorEmailMD5":"3db7b6e14d9da42751e4bab03bc4d034","authorUri":"https://stephencleary.com/","authorUserId":"","authorFallbackAvatar":"","message":"Sorry I was a bit defensive last night. I haven't been getting a lot of sleep due to a newborn in the house...\r\n\r\nThat said, I do disagree. Well, I mean that I agree that async/await is definitely hard to get your mind around at first. But if you follow some basic rules (like not blocking on async code), you avoid most of the pitfalls. If you start with my async intro ( [http://blog.stephencleary.com/2012/02/async-and-await.html](http://blog.stephencleary.com/2012/02/async-and-await.html) ) and followup with my async best practices ( [https://msdn.microsoft.com/en-us/magazine/jj991977.aspx](https://msdn.microsoft.com/en-us/magazine/jj991977.aspx) ), that should give you a pretty good grounding.\r\n\r\nWhether threads are easier or not is up for a bit of debate. I think it's actually a lot easier to shoot yourself in the foot with plain threads. I suspect that you've learned all the problems with threads already (like figuring out when you need locks, when not to set thread priorities, how threads affect shutdown, and establishing lock hierarchies), so threads seem easier to you. And there's definitely a *lot* more information about threads available than async, and (at this point in time) most of it is good info.\r\n\r\nBut I think once you get a good handle on async/await, you'll find it easier than threads. (Technically, async/await doesn't solve problems in the same way as threads at all; especially on server-side code, async is actually the *opposite* of multithreading). At this point in .NET development, threads are practically obsolete. This is why in my book on concurrency I chose not to cover threads *at all*; the concept of threads is described as necessary in the sections on parallelism (which uses TPL / Parallel LINQ instead of plain threads).\r\n\r\nAlso, async/await is in the process of taking over the world. I'm actually writing a talk to be presented at CodeMash on this exact topic. Python, Dart, TypeScript, and even PHP (Hack) already have it. Scala, JavaScript, and C++ are planning to add it (or at least considering it - not sure about the C++ proposal). I'm afraid there is no escape, even if you switch languages (cue evil laugh).","postId":"2012_07_dont-block-on-async-code-abe2d9c7-c3e9-3ed8-827c-021686fa2310","replyTo":"146625ec-e9c1-392e-b5d0-5c2c0b5c2414","date":"2015-10-28T12:47:34Z","timestamp":1446036454}