{"_id":"146625ec-e9c1-392e-b5d0-5c2c0b5c2414","authorName":"jeremiah johnson","authorEmailEncrypted":"cmg+Ra4VVJomc7Z1D+bAlVCfPT0g/2zq5CadLcAgpirXxvGzSu0to9TvT8qkRufjLMB2GtbFnyXSj0cWhNaYnAvVpbvOAhVdVpHgV18atm9WQ2LzwpEnVp5FQMrQWQeZRbLKfYu+otOuOLycLSe1Pt5gAxac9M51XDiP0cMTlMB8t4G8g3Xa7SFHybYZNb+luPE3S/uYYJYnHNJyUmly5qmQ+sTCtd53sJ7jBrK+OzjTtU5KOFX6dfYJL0bQvOtF+cvxZTsbUgN6tB7sq343fjgJ2+vXyv9sFM++Rxl2bqU0Z+mE/CklfVZjAhj2zb8Am2DUf+JRNBbb6WTQ85csyHIEN/a0rSsce2dXptto7k7dqg6FdFbxp+Sx+jeSyZJkzXoEzyqgcbhB6U2HibmvYf0sh2OeLBQPoICZmrYi+PXRcfLh0qsqetFXY4TwBnvVJZ9EwWxokjvht3AOJijaDBR3y21oxVkM3ytYwgR68KuwdWJUQGlzYNcRA0CGIOs/19mPMrKtyy8MimJV9ixb+foGoaN+MWuY2Mr0izLQpGNyJ+NGXu9ErmnUkMr8TcZGUIdlpVNanx1w/1wjApkib7FeRcqVzx03Vf7vGJyCePPGW/A9FnphM74W/9tu1RY82sNXhxX35gd2QdV22k4imSEsLFKNiuETdG4XI4XM7vA=","authorEmailMD5":"54c3a69343a951a798a6c436ac66bc7f","message":"Well, clearly this is all very easy for you, and that's awesome. It wasn't easy for me to figure out. Using await instead of .Result didn't stop the deadlock, for me.\r\n\r\nIt was FAR easier for me to learn how to create a thread and start it years ago when I was just starting as a developer than it was today to attempt to learn this daft deadlock-by-design approach MS used.\r\n\r\nHonestly, async and await, to me, at this moment, look like nothing less than the stretch marks of a language that is trying to do too much at once. Bloat.\r\n\r\nIf I need something to work asynchronously, I'll create a thread that does what I want and call a method from it when it is done. That is SO MUCH EASIER than debugging a freaking deadlock that is designed in to await and async.\r\n\r\nPlease understand that I am not criticising you. Your blog post is the only one that pointed me in the right direction. For that, I thank you.\r\n\r\nI am just kind of done with C# now. I loved C# yesterday. I loved C# 5 years ago. Even 15 years ago when it was a virtual clone of Java.\r\n\r\nYour post got me through today. It won't get me through tomorrow. Time to find a healthier language. For SharePoint work, it will be hard. I'll miss linq dearly. But I am not futzing around with async and await ever again.","postId":"2012_07_dont-block-on-async-code-abe2d9c7-c3e9-3ed8-827c-021686fa2310","replyTo":"c1fae95f-05d9-300d-944d-240b3cbd22c9","date":"2015-10-28T03:03:39Z","timestamp":1446001419,"authorUserId":"disqus:naikrovek"}