{"_id":"a7a5560f-9ee9-375f-ade5-a9d45da44c94","authorName":"greggwon","authorEmailEncrypted":"MAYTp9/cKnt2CldUwnCbsq2BGPGldPXXnCDLaNaLgpaPNsK5NRuGTTrIQMs/kI+xpXChBMardFvhw8DP1spoQ2UM3Xe3anESbmpYaPCUxxe55R/9Gr7Si/ET/xPkTsV0cwCaric5gbzAa2o81GEcHoe2Q2lKuZHdOCBkW8lCQfvbeWeppdSvIXXsmbZChx24fa4yH6CBh/kmrxImRF0LgXBzz6tTNC3Ip5kIA2hTeeKuw4BJZF7elwM2vzxowU8bemr+vrklmQ8V7+bVp2M9TNfEBWN4RYeaLvcffs1Wh21dhhBApNQENmgva7YfQPr8E9y/SDWxmVYEPpMKhKrxnY4YuqJS5mkrlrf1H+Hz0p4BoQ/j4RqlrnaaBRdK4UJ90zboLXT/43APf4NwzAtgbgznzRws5m/rYkHI8QKweu1S/HiYOMa3fO9HvyXCtIzY++XEbycP2TfBDYJBmhaohrpBVIiFBaxj+PznUHkxJn9pzEX9q/g2IrPE128BPYc1lmKQcYbMyaD7U41neMJ3WD3X5nc00ADvoB8wfNFpc+YMR+oYlWphdcdv0PnfGHbu7Xjr5GCt13v/7DIwrA68/GGRn5AIyG+NjFo/qBcSmZWNP/Cz2/ME/cxAk5QBasaeOh8G5BsJDl4Plrq72JTKUadtS/Kk7pg7aozIh9m9EWc=","authorEmailMD5":"142c71b27a71ba2448701da921b0d14e","message":"It really is the windowing software system design that is the issue here. Why is there ever a need for a user to purposefully choose a thread. In this day and age, that should be part of the \"system\" that they develop against. It should provide explicit APIs that manage all of that. It the neglect of the designers to do hours of work that are causing millions of people to experience problems and waste millions of hours of time developing, debugging and using a piece of software that does it wrong.\r\n\r\nI regularly have to ask, why is it that I can click one of the three buttons to close, tile or maximize a window, yet windows can't allow me to grab the title bar and move the window while my machine is accessing the disk during application startup. Even Microsoft is creating a horrible user experience by not managing anything about this \"must use the window thread\" business effectively.\r\n\r\nIt's not hard to devise some different paradigms to fix the problem and even create an automatic dispatch mechanism without burdening the user for doing that. We need to move past all of this context sensitive execution modeling.","postId":"2012_07_dont-block-on-async-code-abe2d9c7-c3e9-3ed8-827c-021686fa2310","replyTo":"1c978b71-601c-3295-9736-e482ad3a1ae7","date":"2017-09-18T18:17:41Z","timestamp":1505758661,"authorUserId":"disqus:greggwon"}