{"_id":"dd990e1e-dbbd-3904-bd06-999567348960","authorName":"Tengiz Tutisani","authorEmailEncrypted":"C071DDjta0qprC6xE0H7nEfB8UVLljQ1sZQlnlRjBw+CjFxFC16gmC5/+M7w63RFmDE4P9Sj+DB9E4JI5+5fxKxbosLY988tET8eGi7MNCSD5G1MPkSnlA+m8flLVuOWbzZdt5enzcBYbq6Y8z0sZg1sXR4ZFx0EGtPPzpMbg/IL9ysA2jAEVjYluTEXqPG3Jhi4E/Jgyi0x9AWg0Qkdz1Q0vXskL2osxJr+AQT5rm1heho3U9iTTyEM8IgJcpFoSyos/Di4mClaPaHJQ8jiqw76cG8tpveNImxqAPmGB+6kDqdIKdvReo9TSXkV56GJbbUc1zFToOOaqxhSMllCetStRbIv3U7+IAlQYqHJi1/6kVuAjNwI26zqI2qoH3V+cQjr6dsjICtINzHamMJnMz+FreS93biEFE6obW3+YtS13xSUQDdBaFTUAbSLZDDwXa4gvL5dGR771fumtyMLC0RrPSp4Zzh4cunKgNM5/2XU5xVBPzjTz5yIA+xcKrmYVeHP9afLBvuCt2BZyF72n7SZ7WfVZs5c2QMMiyU6Z9bLr7uc0htAXNJT1cmbXNWCR0JeZitLjd6XN+nECDgKAD40wAl+VKiKsAGumSPo1QdLB8Q1MVZ5tDnreCE3KBWN5vUrYUmbl78I5aa9zgkV/mPbrWzG/5/TxJXqVyDeYvw=","authorEmailMD5":"0c38a91503d5685bbee3b370fbe8827a","message":"Although helpful post in terms of showing the way to go, I don't agree to the explanations provided.  \r\nConfigureAwait(false) should not be used everywhere, definitely not. It has purpose, and the purpose is not 'swiss knife', I'm sure you know that. Deadlock in your example happens not because of missing ConfigureAwait(false), but because both examples are based on application types where synchronization context is allowed to be accessed only by one thread, instead of any (e.g, as with console apps). If you write your 'deadlock' code for console app, the deadlock will not happen. ConfigureAwait is not relevant to the problem, and it's just distracting in this context. If it was relevant, the code without deadlock would not work without ConfigureAwait, but it works.  \r\nConfigureAwait should not be used blindly everywhere. It should only be used in the UI layers of applications, where you want to have access to the synchronization context once the await is over. If you are writing a class library used in both UI and non-UI applications, you should not be concerned with ConfigureAwait inside the library, but only outside.   \r\nThat is the proper explanation in my opinion.","postId":"2012_07_dont-block-on-async-code-abe2d9c7-c3e9-3ed8-827c-021686fa2310","replyTo":"","date":"2017-01-25T15:00:28Z","timestamp":1485356428,"authorUserId":"disqus:tengiztutisani"}