{"_id":"a5a80c82-e2e1-49fb-b8b0-8be7000f5dc6","postId":"2012_07_dont-block-on-async-code-abe2d9c7-c3e9-3ed8-827c-021686fa2310","postUri":"https://blog.stephencleary.com/2012/07/dont-block-on-async-code.html","replyTo":"","authorEmailEncrypted":"","authorEmailMD5":"","authorName":"Nicolas","authorUri":"","message":"Hi Stephen, \n\nIm currently working on a legacy proyect on net framework 4.6.1 \nI\u0027ve read your post a few times when i started working with asynchronous code, and now here i am seeking for some guidance on an error i can not find my way arround.\n\nIn my code, i have to consume multiple rest services from a third party.\nIn this specific functionality i have to call three services, wich the first two are some authentication services to generate a bearer token.\nIn the third service im consuming, i have to post a json, sending a bearer token, and expect a json as a response.\nI had no problem with the first two services, and i had no problem consumin other services that post and recieve jsons.\n\nThe error im encountering is the following: \nMessage: \u0022A task was cancelled\u0022\nTask   :  id=67 , Status = Canceled, Method = \u0022{null}\u0022, Result = \u0022{Not yet computed}\u0022\n\n\nAs far as i can detect, im reaching a timeout on my client waiting for the response.\nBut, i checked for the network traffic and the third party api responded in less than 15 seconds.\n\nIf i change the default timeout of 100 seconds to 30 seconds, the error pops up in 30 seconds, if i change it to 10 minutes, then it shows at 10 minutes.\n\nMy code is: \nHttpClient client = new HttpClient(); \nclient.BaseAddress = new Uri(\u0022https://exampleurl.com/\u0022);\nclient.DefaultRequestHeaders.Authorization = new AuthenticationHeaderValue(\u0022Bearer\u0022, token.access_token);\nvar response = await client.PostAsJsonAsync(\u0022person/EvaluateDetails\u0022, reqClass).ConfigureAwait(false);\n\n\nIm exposing a rest service to simulate the call on my real code, i had severall layers of code, but i tried moving the call to the third party service to my controller layer and remove all the code in between to see if that would help, but it didnt.\n\n\n\n\nThanks in advance\nNicolas\n","date":"2023-02-15T02:54:12.9867457Z"}