[{"_id":"b9026e8a-3504-383d-9766-da15badb13ed","authorName":"Anonymous","authorEmailEncrypted":"","authorEmailMD5":"","message":"Umm.. WindowStationHandle does not own the handle but does close it by calling NativeMethods.CloseWindowStation. This goes against the recommendation in the 2nd rule. The member this.Handle is just a reference to the handle.","postId":"2009_08_third-rule-of-implementing-idisposable-832d2031-f442-3138-9c21-3930cda700c7","replyTo":"","date":"2011-04-09T19:18:03Z","timestamp":1302376683,"authorUserId":""},{"_id":"e863d6d4-0e7e-3479-b1be-bad04d39439d","authorName":"Stephen Cleary","authorEmailEncrypted":"JH2d5gTO5WiM2j7U4OJsQDt76qsmQxB6wCoV2iYWXrzMJK/O51u0gJrRKeZZfybEXfU7u2Vvo9r2YTh07fh8i+RFTXENFFgUBBCSYaW3MiKaMQjYhRiGiKfcE/mndIVOBjQOeyI9LNmGYK0m52xFrprSx7yQ60A6tw0Qusd0t+NOCIRI3443OIPuVT7t8rj2B5KTICw4axMqvhyxog+maBwnPy1e+0t5BGdPo96Ccry/ZUZbpdd0Ns5ktjGOb8qsy6V1YbK1oOG1mX1+CJRg3Le/QOGwUBthIU32ejYJpNQMwTrS2v8j+NNLmUjW9JGMge9uHY8uPE5CKAuaBbaYftsDbq5Ow2WjPF/rPxypsIYpbOTftS0YF2ZbJHyuCdRjKuLBkTp6LX7j/FS7PDKLKIMwOSDk8e0KRYfAco0uLlvov2cdtTCh/1OgHrt5gwoEuoq3ATfy9eyA9Z/fcdRWGWlAHbP7PFXlvOdTLf2tcDDbS6CZwN90QD9XvQRuM3wc0LA6LqyGuBBYiXeeZsb1+4HnKPkddeizostn5G35VnZrM/3BYceGcIf7DKDRuHtw/+TyI76cM7f3bCi4gPdxG21gTn8hF4fhaw/ImsjmaMRNPeIeEl1YvPHj4VqawqjOzbczRdf3qrNxRUU750eCg9hdL1mQQupXQ3rK8+npRUk=","authorEmailMD5":"ad2250182ff26a84dda974e50cd94382","message":"I'm not sure what you mean.  \r\n\r\nWindowStationHandle does own the unmanaged handle resource. The Handle member (normally provided by the SafeHandle base class) is the handle itself, not \"a reference to the handle.\"  \r\n\r\nWhen I wrap unmanaged resources, I usually have a lower-level wrapper such as WindowStationHandle which owns the unmanaged handle; and a higher-level wrapper (which I would call WindowStation in this example), which owns the managed WindowStationHandle.","postId":"2009_08_third-rule-of-implementing-idisposable-832d2031-f442-3138-9c21-3930cda700c7","replyTo":"","date":"2011-04-10T01:58:06Z","timestamp":1302400686,"authorUserId":""},{"_id":"faebec67-9fb9-3d37-b43f-8acdf3371ac5","authorName":"Anonymous","authorEmailEncrypted":"","authorEmailMD5":"","message":"Most discussions like yours of rule one mention database access as an unmanaged or external (to the CLR) resource. But the MySQL .NET connector has a Dispose method which, according to the rules, makes it a managed wrapper. In fact, the MySQL .NET connector is listed on the MySQL site as fully managed. This makes all my database work fall under the simpler rule two.  \r\n\r\nWhat I'm really saying here is that the statement in your decision matrix that a managed resource is \"an instance of any class implementing IDisposable\" is much more valuable to understanding managed versus unmanaged than indiscriminately saying that a database connection is an example of an unmanaged resource. This was only made clear to me when I searched and found your decision matrix, which you intentionally split into a separate post. I really think you should throw in a link to that article in every \"Three simple rules\" page. I don't see it otherwise. Very valuable.  \r\n\r\nI've read a lot of very long, technical articles about the disposal pattern, most of which I didn't understand because they all seem to be written for someone who works in the MS OS development group or work through the API exclusively. That includes your own \"What Your Mother Never Told You...\" article. LOL. I work almost exclusively at the managed level, and it took me a while to really understand that. Your articles here have taken all the low-level obscurity and made it accessible and concise for application programmers like me. Thanks for the great work. It's really appreciated.","postId":"2009_08_third-rule-of-implementing-idisposable-832d2031-f442-3138-9c21-3930cda700c7","replyTo":"","date":"2012-03-23T07:07:44Z","timestamp":1332486464,"authorUserId":""},{"_id":"d0207921-4c1f-31c0-ab92-0c9f78f3fa6e","authorName":"Stephen Cleary","authorEmailEncrypted":"AvAajEwi+e79mXbcvF4usYQLk2t2C6+sATLxFpIvegank/Va68iKQBWR36tuZ5c0n5BM5NWrQ9CJgWn48gRY28QAbWn5MsX0sVFw4jc0oEfTZRDhdLafwtJHIXh4jWC2DfoYTexoYX1Yin6BL9kCcvHBJSZlm6pY+DOeac+FIvNAI9GqwIo1ZzLArU83yvisPZ01ExxrFghJEgXzGKExe+b8QpMZnTweOupR1AWMI4YgXYtc4h4x+nroe9jqgW+kIo+uWqgRl6yszFaZpDbpzpgVszVfT71vXlXA1BmelHoIqSeIp9W98CqrFmkZYvpaUhZiTdyijflj12EIcBw6zkuyZvlgZc7bqG/A0qt0wBujDKMStIEqEWAB+xizjPRFtJRiav/mlO38ox4d2XgM6wOOSsfLAvPqyrnjeXgOhSVa45uw8Sbdg+8abhFIS9FWe8CrnS9R7afdfd9fy85TY2RJU7CqibbUsSojR2JcOTSzEkSPPvHhpLxnWduPMV31jvirq6lXkfMTE5HcG936YYTfvJ/oaggk4sVYVkjeSDgiT9CV8YjCim2Wc1scRv6yL3FW9k7mdEkeFqAZd2tGvGfDgNpMDsWsLhZyuxiCO7K4r3wm9jYPY1BkkLVfGtlLaf+OPePNUpPcK2j1+A9+7qVPDe1sL/5fxDG2MTOsNB4=","authorEmailMD5":"ad2250182ff26a84dda974e50cd94382","message":"Thanks for the kind words.  \r\n\r\nThe Official Authorized Recommended IDisposable Pattern was designed to handle every possible situation - including base classes with a mix of unmanaged and managed resources being extended by a derived class with a mix of unmanaged and managed resources. This dates back to .NET 1.0.  \r\n\r\nWith .NET 2.0, Microsoft went through and changed all that. They still implement the IDisposable pattern just in case anyone was depending on it, but internally they split everything into \"unmanaged resource owners\" and \"managed resource owners\".  \r\n\r\nWhen I started writing about IDisposable, I was actually just documenting what Microsoft's actual practice was rather than their official recommendation (except for unsealed disposables).","postId":"2009_08_third-rule-of-implementing-idisposable-832d2031-f442-3138-9c21-3930cda700c7","replyTo":"","date":"2012-04-14T02:28:23Z","timestamp":1334370503,"authorUserId":""},{"_id":"b4edf360-cb7f-3912-b85c-7474fb081ff0","authorName":"Bombadil","authorEmailEncrypted":"","authorEmailMD5":"","message":"If the intention of this example is to be as fail safe as possible I would avoid calling a method with unknown performance and (b)locking characteristics like Trace.WriteLine and new Win32Exception from the finalizer. Whatever is intended, we should always make sure that the finalizer thread just does the bare minimum of activity for stability and scalability reasons.   \r\nI would also avoid the string concatenation which would cause a new memory allocation from the finalizer thread.","postId":"2009_08_third-rule-of-implementing-idisposable-832d2031-f442-3138-9c21-3930cda700c7","replyTo":"","date":"2014-03-21T12:33:10Z","timestamp":1395405190,"authorUserId":""}]