{"_id":"fbd0d73c-ce20-398d-a167-05b121d8c782","authorName":"Jason.W He","authorEmailEncrypted":"CBswEPTfzC//6VEvsWSANC/gDCqFkLGFaTG9Add0lCTrGrDbExTEGS7a7cgKm19UIQOXQ8yCzBek1hlZbtNARErogOAzxGvgy5a7IjdgGJTtH9Mkd40Ba9R7eZFBo+qNkDLA/Cr/MgVz97N9TVT3kNuW2w40OI9nF0PIg3xEKNZNWoZfyGjeSjBAj/5kpNpxNPFVci2QXY4A60RS/1Kz+Qwmy7MR2w+qpgDJ3ZTnaQ8S4jLj9S420Pan0fOmI2W1tCDD0PQrzHxb1rYxw4aB+F65SouGVxi1yc2e6HFmbX78Cfs9Y5HY7uZXmO8UjRUJu8yyCvXTFo9E5oSSWE3kfv9qruJHclQKvJ5auGYzh4I7ZDCgW/A5QFc5FGsS2VdUElTEEB81Wg1gZxtwVkDKswhoFmik0TCltREB00y/PusUDPtnA676zXRiYiMToKerGoBwKKxqUaXh++0Hz6dFYfHJiUJGswh0xRkBFsHE+jlQ9Xj89AeGhdDVh/TrZ91vw/vr3Gor53gm/mmi90WzUp5DKsk+ThZRA7df0UM7iWkbcVcH1+DvLlNGEnAgteTCO/pFVL8EcOoRrlJ9E0acZsplxAintp1w36VmjRUpp7BUG2ZAAOgCdHUymMuoUdIxWATK0KH/VoSnFvOlLknIVCwnzWepMQsw8Ek5JSriXa8=","authorEmailMD5":"3d2870f3340f3838d9393d91ed81077f","message":"From my point of view, your explanation on Single Responsibility Principle is a bit weird. View model and view is similar as interface in OOP. There is a contract between view model and view, if contract changed both have to change. Else not really.\r\n\r\nReact doesn't solve that, it has contract as well but all in one file as jsx. Now the problem changed. Change to whether multiple files means against single responsibility or not. Do you against interface in C#? If you change interface you have to change all the files that's implement on top of that interface. If according to your theory, do I have to merge all of them just use if loop?\r\n\r\nOn the other hand if you read about zen of python, then take look at react-bootstrap project. [https://react-bootstrap.git...](https://react-bootstrap.github.io/components.html \"https://react-bootstrap.github.io/components.html\")\r\n\r\nImagine if you only understand html and css and you want to fix something for project, do you know what's going on with react-bootstrap's syntax? React-bootstrap makes you to lean several things. Bootstrap syntax, html, css, react-bootstrap syntax, react itself.\r\n\r\nNow if we come down to MVVM approach, how many do we have to learn? Bootstrap syntax, html, css and view syntax. One opponent less and view looks more straight forward, less mythic components.\r\n\r\nOf course that's too specific with one way of implementation. I'm not against react but I don't think react is far advanced than MVVM approach. Flux itself can apply to MVVM too, it depends on how you write your application.","postId":"2016_02_why-react-why-redux-426204a1-cf4b-312a-8999-d6adcc021e7a","replyTo":"","date":"2016-02-15T19:38:42Z","timestamp":1455565122,"authorUserId":"disqus:jasonwhe"}