{"_id":"35499f60-373c-35e7-b61c-059b68e25c38","authorName":"Stephen Cleary","authorEmailEncrypted":"Im0IFZqG9WW0iRwGMmk+WLyyfrgUmDonKknN3NoINMZaJgiS8TB0poo7NU42iAAL+n3HhBfPCGxMH2qkL0kRLqBFFEEMDkRgh42VLUG0hYMbcZbhvEFEvqpvsXYw37oBdyPBSOBXM3gD97eZV2nZT21wA0zBkvtgCax2ZYY2+3T0Ldkl+/vbsO61790NUbfZMAIXMcUxd+rMw93JkTElw/TLA11Qs4FgBdwxS1cIWldzuzUdSrQNYoHaIgoTuawsLsGOj3ObRPm4Cr/eR1epQbZuW4o1Hbiv5VRdqVGvEHgsbR33ogfsAU5jZl8V2nVJKwcFHm5CV3Oh858El4ZU5eDsHwyaQRgqPw4QLYozGPj5sp+08OUgS97WBc8o0QJhIWHYxVBD7pBAUIxsWOi0RX0ivlURI8z6kqqelPVNPeuwFX5KHv2Jm990xlNqOu4f319QONhfOuIRW3oONvAhEi0zU498uhX0tbzEynth4c4QhopSAmTtmLYcgLx9ua12lAZYZZcxpkhQfPlU7lJCN2nrdlyamX/h9nV9zDApFK3wO/pTEzU0/k9em0j6fJwhboSg5rU4Txjb9MFeYXIst4kZXeo/odo/awsYAbJhUIorku7kiAk/37dPoujzQnD/jmoXcKdIKSjnP+/R7MOTw0JLwGA0CyKVr1CJsUZbS/M=","authorEmailMD5":"ad2250182ff26a84dda974e50cd94382","authorUri":"","authorUserId":"disqus:stephen_cleary","message":"There was already a way to create a canceled task that did *not* take a CancellationToken (via TaskCompletionSource<t>.SetCanceled). The new methods *do* take a CancellationToken because technically, that's the right way to do it.\r\n\r\nThe CancellationToken is observable if that task is await'ed - it will throw an OperationCanceledException whose CancellationToken identifies which token caused the cancellation. The use case for this is rare but real: when calling an API that can be canceled different ways (e.g., a timeout or a user-requested cancellation), and if it's important to determine which one canceled it, then the caller can examine OperationCanceledException.CancellationToken. In most cases, just checking CT.IsCancellationRequested on both CTs would be sufficient, but sometimes it's necessary to know which one *actually cancelled* the operation and just using IsCancellationRequested would cause race conditions (e.g., if the user caused the cancellation but then the timeout expired before the CT checks).\r\n\r\nIt's also just cleaner and nicer to pass a CancellationToken because that's the standard cancellation semantics.\r\n\r\nI think the article you referenced is a bit confusing:  \r\n- The ArgumentOutOfRange exception is thrown directly. That is, if you pass an uncanceled CT into Task.FromCanceled, the exception is *not* placed on the task. It's a usage error - a boneheaded exception, as Eric Lippert calls it - and is thrown immediately and directly from Task.FromCanceled. Code should never call Task.FromCanceled with an uncanceled CT. That exception indicates a bug in the calling code.  \r\n- You would (almost) always pass in a local CancellationToken. You'd (almost) never want to pass in \"new CancellationToken(true)\". If you find yourself in this situation, it means you're writing an asynchronous API that can produce canceled tasks but does not provide a way to cancel them. That goes against the common semantics - a more appropriate exception would almost certainly be better than OperationCanceledException in that case.\r\n\r\nI'm hesitating using \"always\" and \"never\" in that last point, but honestly, I can't think of a single situation where you would ever *want* to pass \"new CancellationToken(true)\".","postId":"2015_04_a-tour-of-task-part-10-promise-tasks-76cdd5a7-1909-3432-9e00-8acd3cd4350c","replyTo":"4bbc17a8-d527-3b60-8856-f32f0cdece00","date":"2016-08-20T01:05:47Z","timestamp":1471655147}